
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AdvancedSessions
/// dependency: AIModule
/// dependency: AnimGraphRuntime
/// dependency: ClientAuthoritativeCharacterSystem
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: InputCore
/// dependency: NavigationSystem
/// dependency: Niagara
/// dependency: OnlineSubsystemUtils
/// dependency: Slate
/// dependency: SlateCore
/// dependency: SteamCorePro
/// dependency: UMG
/// dependency: VaRest

#pragma pack(push, 0x1)

/// Enum /Game/Blueprints/Characters/E_MovementModes.E_MovementModes
/// Size: 0x01 (1 bytes)
enum class E_MovementModes : uint8_t
{
	E_MovementModes__NewEnumerator0                                                  = 0,
	E_MovementModes__NewEnumerator1                                                  = 1,
	E_MovementModes__NewEnumerator2                                                  = 2
};

/// Enum /Game/Blueprints/Equipables/E_EquipableSprintStyles.E_EquipableSprintStyles
/// Size: 0x01 (1 bytes)
enum class E_EquipableSprintStyles : uint8_t
{
	E_EquipableSprintStyles__NewEnumerator0                                          = 0,
	E_EquipableSprintStyles__NewEnumerator1                                          = 1,
	E_EquipableSprintStyles__NewEnumerator2                                          = 2,
	E_EquipableSprintStyles__NewEnumerator3                                          = 3,
	E_EquipableSprintStyles__NewEnumerator4                                          = 4,
	E_EquipableSprintStyles__NewEnumerator5                                          = 5
};

/// Enum /Game/Blueprints/Vehicles/E_PlaneStrafingStates.E_PlaneStrafingStates
/// Size: 0x01 (1 bytes)
enum class E_PlaneStrafingStates : uint8_t
{
	E_PlaneStrafingStates__NewEnumerator0                                            = 0,
	E_PlaneStrafingStates__NewEnumerator1                                            = 1,
	E_PlaneStrafingStates__NewEnumerator2                                            = 2
};

/// Enum /Game/Blueprints/Vehicles/E_VehicleAnimationTypes.E_VehicleAnimationTypes
/// Size: 0x01 (1 bytes)
enum class E_VehicleAnimationTypes : uint8_t
{
	E_VehicleAnimationTypes__NewEnumerator1                                          = 0,
	E_VehicleAnimationTypes__NewEnumerator0                                          = 1,
	E_VehicleAnimationTypes__NewEnumerator2                                          = 2,
	E_VehicleAnimationTypes__NewEnumerator3                                          = 3
};

/// Enum /Game/Blueprints/E_VoteOptions.E_VoteOptions
/// Size: 0x01 (1 bytes)
enum class E_VoteOptions : uint8_t
{
	E_VoteOptions__NewEnumerator0                                                    = 0,
	E_VoteOptions__NewEnumerator1                                                    = 1,
	E_VoteOptions__NewEnumerator2                                                    = 2
};

/// Enum /Game/Blueprints/E_CombatZoneTypes.E_CombatZoneTypes
/// Size: 0x01 (1 bytes)
enum class E_CombatZoneTypes : uint8_t
{
	E_CombatZoneTypes__NewEnumerator0                                                = 0,
	E_CombatZoneTypes__NewEnumerator1                                                = 1,
	E_CombatZoneTypes__NewEnumerator2                                                = 2,
	E_CombatZoneTypes__NewEnumerator3                                                = 3
};

/// Enum /Game/Blueprints/Objectives/E_SpawnTypes.E_SpawnTypes
/// Size: 0x01 (1 bytes)
enum class E_SpawnTypes : uint8_t
{
	E_SpawnTypes__NewEnumerator0                                                     = 0,
	E_SpawnTypes__NewEnumerator1                                                     = 1,
	E_SpawnTypes__NewEnumerator2                                                     = 2,
	E_SpawnTypes__NewEnumerator3                                                     = 3
};

/// Enum /Game/Blueprints/CosmeticItems/E_ChestTypes.E_ChestTypes
/// Size: 0x01 (1 bytes)
enum class E_ChestTypes : uint8_t
{
	E_ChestTypes__NewEnumerator0                                                     = 0,
	E_ChestTypes__NewEnumerator1                                                     = 1
};

/// Enum /Game/Blueprints/Skills/E_SkillSlots.E_SkillSlots
/// Size: 0x01 (1 bytes)
enum class E_SkillSlots : uint8_t
{
	E_SkillSlots__NewEnumerator0                                                     = 0,
	E_SkillSlots__NewEnumerator1                                                     = 1
};

/// Enum /Game/Blueprints/Vehicles/E_AlternatePlaneWeapons.E_AlternatePlaneWeapons
/// Size: 0x01 (1 bytes)
enum class E_AlternatePlaneWeapons : uint8_t
{
	E_AlternatePlaneWeapons__NewEnumerator0                                          = 0,
	E_AlternatePlaneWeapons__NewEnumerator1                                          = 1
};

/// Enum /Game/Blueprints/Equipables/E_WeaponRange.E_WeaponRange
/// Size: 0x01 (1 bytes)
enum class E_WeaponRange : uint8_t
{
	E_WeaponRange__NewEnumerator0                                                    = 0,
	E_WeaponRange__NewEnumerator1                                                    = 1,
	E_WeaponRange__NewEnumerator3                                                    = 2,
	E_WeaponRange__NewEnumerator4                                                    = 3,
	E_WeaponRange__NewEnumerator5                                                    = 4,
	E_WeaponRange__NewEnumerator7                                                    = 5,
	E_WeaponRange__NewEnumerator8                                                    = 6,
	E_WeaponRange__NewEnumerator10                                                   = 7,
	E_WeaponRange__NewEnumerator11                                                   = 8,
	E_WeaponRange__NewEnumerator12                                                   = 9,
	E_WeaponRange__NewEnumerator13                                                   = 10,
	E_WeaponRange__NewEnumerator14                                                   = 11,
	E_WeaponRange__NewEnumerator15                                                   = 12,
	E_WeaponRange__NewEnumerator16                                                   = 13,
	E_WeaponRange__NewEnumerator17                                                   = 14
};

/// Enum /Game/Blueprints/Equipables/E_TrailLengths.E_TrailLengths
/// Size: 0x01 (1 bytes)
enum class E_TrailLengths : uint8_t
{
	E_TrailLengths__NewEnumerator0                                                   = 0,
	E_TrailLengths__NewEnumerator1                                                   = 1,
	E_TrailLengths__NewEnumerator2                                                   = 2
};

/// Enum /Game/Blueprints/Equipables/E_WeaponTypes.E_WeaponTypes
/// Size: 0x01 (1 bytes)
enum class E_WeaponTypes : uint8_t
{
	E_WeaponTypes__NewEnumerator2                                                    = 0,
	E_WeaponTypes__NewEnumerator0                                                    = 1,
	E_WeaponTypes__NewEnumerator1                                                    = 2,
	E_WeaponTypes__NewEnumerator3                                                    = 3,
	E_WeaponTypes__NewEnumerator4                                                    = 4,
	E_WeaponTypes__NewEnumerator5                                                    = 5,
	E_WeaponTypes__NewEnumerator6                                                    = 6,
	E_WeaponTypes__NewEnumerator7                                                    = 7,
	E_WeaponTypes__NewEnumerator8                                                    = 8,
	E_WeaponTypes__NewEnumerator9                                                    = 9,
	E_WeaponTypes__NewEnumerator10                                                   = 10,
	E_WeaponTypes__NewEnumerator11                                                   = 11,
	E_WeaponTypes__NewEnumerator12                                                   = 12,
	E_WeaponTypes__NewEnumerator13                                                   = 13,
	E_WeaponTypes__NewEnumerator14                                                   = 14
};

/// Enum /Game/Blueprints/Vehicles/E_VehicleSkinThemes.E_VehicleSkinThemes
/// Size: 0x01 (1 bytes)
enum class E_VehicleSkinThemes : uint8_t
{
	E_VehicleSkinThemes__NewEnumerator0                                              = 0,
	E_VehicleSkinThemes__NewEnumerator1                                              = 1,
	E_VehicleSkinThemes__NewEnumerator2                                              = 2,
	E_VehicleSkinThemes__NewEnumerator3                                              = 3
};

/// Enum /Game/Blueprints/AI/E_AITeamPlayStyles.E_AITeamPlayStyles
/// Size: 0x01 (1 bytes)
enum class E_AITeamPlayStyles : uint8_t
{
	E_AITeamPlayStyles__NewEnumerator0                                               = 0,
	E_AITeamPlayStyles__NewEnumerator1                                               = 1,
	E_AITeamPlayStyles__NewEnumerator2                                               = 2,
	E_AITeamPlayStyles__NewEnumerator3                                               = 3
};

/// Enum /Game/Blueprints/Gamemodes/E_GameModes.E_GameModes
/// Size: 0x01 (1 bytes)
enum class E_GameModes : uint8_t
{
	E_GameModes__NewEnumerator0                                                      = 0,
	E_GameModes__NewEnumerator1                                                      = 1,
	E_GameModes__NewEnumerator2                                                      = 2,
	E_GameModes__NewEnumerator3                                                      = 3,
	E_GameModes__NewEnumerator4                                                      = 4,
	E_GameModes__NewEnumerator5                                                      = 5,
	E_GameModes__NewEnumerator6                                                      = 6
};

/// Enum /Game/Blueprints/CosmeticItems/E_SteamItemRarities.E_SteamItemRarities
/// Size: 0x01 (1 bytes)
enum class E_SteamItemRarities : uint8_t
{
	E_SteamItemRarities__NewEnumerator3                                              = 0,
	E_SteamItemRarities__NewEnumerator0                                              = 1,
	E_SteamItemRarities__NewEnumerator1                                              = 2,
	E_SteamItemRarities__NewEnumerator2                                              = 3
};

/// Enum /Game/Blueprints/Projectiles/E_DamageTypes.E_DamageTypes
/// Size: 0x01 (1 bytes)
enum class E_DamageTypes : uint8_t
{
	E_DamageTypes__NewEnumerator1                                                    = 0,
	E_DamageTypes__NewEnumerator2                                                    = 1,
	E_DamageTypes__NewEnumerator0                                                    = 2,
	E_DamageTypes__NewEnumerator3                                                    = 3,
	E_DamageTypes__NewEnumerator4                                                    = 4,
	E_DamageTypes__NewEnumerator5                                                    = 5,
	E_DamageTypes__NewEnumerator6                                                    = 6,
	E_DamageTypes__NewEnumerator7                                                    = 7,
	E_DamageTypes__NewEnumerator8                                                    = 8,
	E_DamageTypes__NewEnumerator9                                                    = 9,
	E_DamageTypes__NewEnumerator10                                                   = 10,
	E_DamageTypes__NewEnumerator11                                                   = 11
};

/// Enum /Game/Blueprints/CosmeticItems/E_UnlockableCategories.E_UnlockableCategories
/// Size: 0x01 (1 bytes)
enum class E_UnlockableCategories : uint8_t
{
	E_UnlockableCategories__NewEnumerator0                                           = 0,
	E_UnlockableCategories__NewEnumerator1                                           = 1,
	E_UnlockableCategories__NewEnumerator2                                           = 2,
	E_UnlockableCategories__NewEnumerator3                                           = 3,
	E_UnlockableCategories__NewEnumerator4                                           = 4,
	E_UnlockableCategories__NewEnumerator5                                           = 5,
	E_UnlockableCategories__NewEnumerator6                                           = 6,
	E_UnlockableCategories__NewEnumerator7                                           = 7,
	E_UnlockableCategories__NewEnumerator8                                           = 8,
	E_UnlockableCategories__NewEnumerator9                                           = 9,
	E_UnlockableCategories__NewEnumerator10                                          = 10,
	E_UnlockableCategories__NewEnumerator11                                          = 11,
	E_UnlockableCategories__NewEnumerator12                                          = 12,
	E_UnlockableCategories__NewEnumerator13                                          = 13,
	E_UnlockableCategories__NewEnumerator14                                          = 14,
	E_UnlockableCategories__NewEnumerator15                                          = 15,
	E_UnlockableCategories__NewEnumerator16                                          = 16,
	E_UnlockableCategories__NewEnumerator17                                          = 17,
	E_UnlockableCategories__NewEnumerator18                                          = 18,
	E_UnlockableCategories__NewEnumerator19                                          = 19,
	E_UnlockableCategories__NewEnumerator20                                          = 20,
	E_UnlockableCategories__NewEnumerator21                                          = 21,
	E_UnlockableCategories__NewEnumerator22                                          = 22,
	E_UnlockableCategories__NewEnumerator23                                          = 23,
	E_UnlockableCategories__NewEnumerator24                                          = 24
};

/// Enum /Game/Blueprints/CosmeticItems/E_SpecialPrivileges.E_SpecialPrivileges
/// Size: 0x01 (1 bytes)
enum class E_SpecialPrivileges : uint8_t
{
	E_SpecialPrivileges__NewEnumerator1                                              = 0,
	E_SpecialPrivileges__NewEnumerator0                                              = 1
};

/// Enum /Game/Blueprints/E_Teams.E_Teams
/// Size: 0x01 (1 bytes)
enum class E_Teams : uint8_t
{
	E_Teams__NewEnumerator2                                                          = 0,
	E_Teams__NewEnumerator0                                                          = 1,
	E_Teams__NewEnumerator1                                                          = 2
};

/// Enum /Game/Blueprints/LightingScenarios/E_Scenarios.E_Scenarios
/// Size: 0x01 (1 bytes)
enum class E_Scenarios : uint8_t
{
	E_Scenarios__NewEnumerator0                                                      = 0,
	E_Scenarios__NewEnumerator1                                                      = 1,
	E_Scenarios__NewEnumerator2                                                      = 2,
	E_Scenarios__NewEnumerator3                                                      = 3
};

/// Enum /Game/Blueprints/E_Units.E_Units
/// Size: 0x01 (1 bytes)
enum class E_Units : uint8_t
{
	E_Units__NewEnumerator0                                                          = 0,
	E_Units__NewEnumerator1                                                          = 1,
	E_Units__NewEnumerator2                                                          = 2,
	E_Units__NewEnumerator3                                                          = 3,
	E_Units__NewEnumerator4                                                          = 4,
	E_Units__NewEnumerator5                                                          = 5
};

/// Enum /Game/Blueprints/CosmeticItems/E_EventCategories.E_EventCategories
/// Size: 0x01 (1 bytes)
enum class E_EventCategories : uint8_t
{
	E_EventCategories__NewEnumerator4                                                = 0,
	E_EventCategories__NewEnumerator0                                                = 1,
	E_EventCategories__NewEnumerator1                                                = 2
};

/// Enum /Game/Character/E_MotorbikePoses.E_MotorbikePoses
/// Size: 0x01 (1 bytes)
enum class E_MotorbikePoses : uint8_t
{
	E_MotorbikePoses__NewEnumerator0                                                 = 0,
	E_MotorbikePoses__NewEnumerator1                                                 = 1,
	E_MotorbikePoses__NewEnumerator2                                                 = 2,
	E_MotorbikePoses__NewEnumerator3                                                 = 3,
	E_MotorbikePoses__NewEnumerator4                                                 = 4,
	E_MotorbikePoses__NewEnumerator5                                                 = 5,
	E_MotorbikePoses__NewEnumerator6                                                 = 6,
	E_MotorbikePoses__NewEnumerator7                                                 = 7
};

/// Enum /Game/Character/E_MeleeModes.E_MeleeModes
/// Size: 0x01 (1 bytes)
enum class E_MeleeModes : uint8_t
{
	E_MeleeModes__NewEnumerator0                                                     = 0,
	E_MeleeModes__NewEnumerator1                                                     = 1,
	E_MeleeModes__NewEnumerator2                                                     = 2
};

/// Enum /Game/Character/E_WeaponPoses.E_WeaponPoses
/// Size: 0x01 (1 bytes)
enum class E_WeaponPoses : uint8_t
{
	E_WeaponPoses__NewEnumerator0                                                    = 0,
	E_WeaponPoses__NewEnumerator1                                                    = 1,
	E_WeaponPoses__NewEnumerator2                                                    = 2,
	E_WeaponPoses__NewEnumerator3                                                    = 3,
	E_WeaponPoses__NewEnumerator4                                                    = 4,
	E_WeaponPoses__NewEnumerator5                                                    = 5,
	E_WeaponPoses__NewEnumerator6                                                    = 6,
	E_WeaponPoses__NewEnumerator7                                                    = 7,
	E_WeaponPoses__NewEnumerator8                                                    = 8,
	E_WeaponPoses__NewEnumerator9                                                    = 9,
	E_WeaponPoses__NewEnumerator10                                                   = 10,
	E_WeaponPoses__NewEnumerator11                                                   = 11,
	E_WeaponPoses__NewEnumerator12                                                   = 12,
	E_WeaponPoses__NewEnumerator13                                                   = 13,
	E_WeaponPoses__NewEnumerator15                                                   = 14,
	E_WeaponPoses__NewEnumerator16                                                   = 15,
	E_WeaponPoses__NewEnumerator17                                                   = 16,
	E_WeaponPoses__NewEnumerator18                                                   = 17,
	E_WeaponPoses__NewEnumerator19                                                   = 18,
	E_WeaponPoses__NewEnumerator20                                                   = 19,
	E_WeaponPoses__NewEnumerator21                                                   = 20,
	E_WeaponPoses__NewEnumerator22                                                   = 21,
	E_WeaponPoses__NewEnumerator23                                                   = 22
};

/// Enum /Game/Widgets/E_Menus.E_Menus
/// Size: 0x01 (1 bytes)
enum class E_Menus : uint8_t
{
	E_Menus__NewEnumerator0                                                          = 0,
	E_Menus__NewEnumerator1                                                          = 1
};

/// Enum /Game/Widgets/E_ActionbarSlotStyles.E_ActionbarSlotStyles
/// Size: 0x01 (1 bytes)
enum class E_ActionbarSlotStyles : uint8_t
{
	E_ActionbarSlotStyles__NewEnumerator0                                            = 0,
	E_ActionbarSlotStyles__NewEnumerator1                                            = 1,
	E_ActionbarSlotStyles__NewEnumerator2                                            = 2,
	E_ActionbarSlotStyles__NewEnumerator3                                            = 3,
	E_ActionbarSlotStyles__NewEnumerator4                                            = 4,
	E_ActionbarSlotStyles__NewEnumerator5                                            = 5
};

/// Enum /Game/Widgets/E_WeaponCrosshairStyles.E_WeaponCrosshairStyles
/// Size: 0x01 (1 bytes)
enum class E_WeaponCrosshairStyles : uint8_t
{
	E_WeaponCrosshairStyles__NewEnumerator0                                          = 0,
	E_WeaponCrosshairStyles__NewEnumerator1                                          = 1,
	E_WeaponCrosshairStyles__NewEnumerator2                                          = 2,
	E_WeaponCrosshairStyles__NewEnumerator3                                          = 3,
	E_WeaponCrosshairStyles__NewEnumerator4                                          = 4,
	E_WeaponCrosshairStyles__NewEnumerator5                                          = 5,
	E_WeaponCrosshairStyles__NewEnumerator6                                          = 6,
	E_WeaponCrosshairStyles__NewEnumerator7                                          = 7,
	E_WeaponCrosshairStyles__NewEnumerator8                                          = 8
};

/// Enum /Game/Widgets/E_Selectables.E_Selectables
/// Size: 0x01 (1 bytes)
enum class E_Selectables : uint8_t
{
	E_Selectables__NewEnumerator0                                                    = 0,
	E_Selectables__NewEnumerator1                                                    = 1,
	E_Selectables__NewEnumerator2                                                    = 2,
	E_Selectables__NewEnumerator3                                                    = 3,
	E_Selectables__NewEnumerator4                                                    = 4,
	E_Selectables__NewEnumerator5                                                    = 5,
	E_Selectables__NewEnumerator6                                                    = 6,
	E_Selectables__NewEnumerator7                                                    = 7,
	E_Selectables__NewEnumerator8                                                    = 8,
	E_Selectables__NewEnumerator9                                                    = 9,
	E_Selectables__NewEnumerator10                                                   = 10,
	E_Selectables__NewEnumerator11                                                   = 11,
	E_Selectables__NewEnumerator12                                                   = 12,
	E_Selectables__NewEnumerator13                                                   = 13,
	E_Selectables__NewEnumerator14                                                   = 14,
	E_Selectables__NewEnumerator15                                                   = 15,
	E_Selectables__NewEnumerator16                                                   = 16,
	E_Selectables__NewEnumerator17                                                   = 17,
	E_Selectables__NewEnumerator18                                                   = 18,
	E_Selectables__NewEnumerator19                                                   = 19,
	E_Selectables__NewEnumerator20                                                   = 20,
	E_Selectables__NewEnumerator21                                                   = 21,
	E_Selectables__NewEnumerator22                                                   = 22,
	E_Selectables__NewEnumerator23                                                   = 23,
	E_Selectables__NewEnumerator25                                                   = 24,
	E_Selectables__NewEnumerator26                                                   = 25,
	E_Selectables__NewEnumerator27                                                   = 26,
	E_Selectables__NewEnumerator28                                                   = 27,
	E_Selectables__NewEnumerator29                                                   = 28,
	E_Selectables__NewEnumerator30                                                   = 29,
	E_Selectables__NewEnumerator31                                                   = 30,
	E_Selectables__NewEnumerator32                                                   = 31,
	E_Selectables__NewEnumerator33                                                   = 32,
	E_Selectables__NewEnumerator34                                                   = 33,
	E_Selectables__NewEnumerator35                                                   = 34,
	E_Selectables__NewEnumerator36                                                   = 35
};

/// Enum /Game/Widgets/E_CrosshairTypes.E_CrosshairTypes
/// Size: 0x01 (1 bytes)
enum class E_CrosshairTypes : uint8_t
{
	E_CrosshairTypes__NewEnumerator0                                                 = 0,
	E_CrosshairTypes__NewEnumerator2                                                 = 1,
	E_CrosshairTypes__NewEnumerator3                                                 = 2
};

/// Enum /Game/Widgets/E_ScopeType.E_ScopeType
/// Size: 0x01 (1 bytes)
enum class E_ScopeType : uint8_t
{
	E_ScopeType__NewEnumerator0                                                      = 0,
	E_ScopeType__NewEnumerator1                                                      = 1
};

/// Enum /Game/Widgets/E_CurrencyTypes.E_CurrencyTypes
/// Size: 0x01 (1 bytes)
enum class E_CurrencyTypes : uint8_t
{
	E_CurrencyTypes__NewEnumerator0                                                  = 0,
	E_CurrencyTypes__NewEnumerator2                                                  = 1,
	E_CurrencyTypes__NewEnumerator1                                                  = 2,
	E_CurrencyTypes__NewEnumerator3                                                  = 3,
	E_CurrencyTypes__NewEnumerator4                                                  = 4,
	E_CurrencyTypes__NewEnumerator5                                                  = 5,
	E_CurrencyTypes__NewEnumerator6                                                  = 6,
	E_CurrencyTypes__NewEnumerator7                                                  = 7,
	E_CurrencyTypes__NewEnumerator8                                                  = 8
};

/// Enum /Game/Widgets/E_PrestigeRanks.E_PrestigeRanks
/// Size: 0x01 (1 bytes)
enum class E_PrestigeRanks : uint8_t
{
	E_PrestigeRanks__NewEnumerator0                                                  = 0,
	E_PrestigeRanks__NewEnumerator1                                                  = 1,
	E_PrestigeRanks__NewEnumerator2                                                  = 2,
	E_PrestigeRanks__NewEnumerator3                                                  = 3,
	E_PrestigeRanks__NewEnumerator4                                                  = 4,
	E_PrestigeRanks__NewEnumerator5                                                  = 5,
	E_PrestigeRanks__NewEnumerator7                                                  = 6
};

/// Class /Game/Blueprints/AI/Task_MoveToObjective.Task_MoveToObjective_C
/// Size: 0x00C9 (201 bytes) (0x0000A8 - 0x0000C9) align 8 MaxSize: 0x00C9
class UTask_MoveToObjective_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	float                                              DefendRoamingTimer;                                         // 0x00B0   (0x0004)  
	float                                              TimeToStayInDefendLocation;                                 // 0x00B4   (0x0004)  
	float                                              LastTimeInSeconds;                                          // 0x00B8   (0x0004)  
	FVector                                            ObjectiveLocation;                                          // 0x00BC   (0x000C)  
	bool                                               StayOnLocation;                                             // 0x00C8   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_MoveToObjective.Task_MoveToObjective_C.OnFail_CE9416B347F4F6D7ED0A25B053161052
	// void OnFail_CE9416B347F4F6D7ED0A25B053161052(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToObjective.Task_MoveToObjective_C.OnSuccess_CE9416B347F4F6D7ED0A25B053161052
	// void OnSuccess_CE9416B347F4F6D7ED0A25B053161052(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToObjective.Task_MoveToObjective_C.OnFail_D0C780294E32A35C6CC435B2A0EB9EB6
	// void OnFail_D0C780294E32A35C6CC435B2A0EB9EB6(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToObjective.Task_MoveToObjective_C.OnSuccess_D0C780294E32A35C6CC435B2A0EB9EB6
	// void OnSuccess_D0C780294E32A35C6CC435B2A0EB9EB6(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToObjective.Task_MoveToObjective_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToObjective.Task_MoveToObjective_C.ExecuteUbergraph_Task_MoveToObjective
	// void ExecuteUbergraph_Task_MoveToObjective(int32_t EntryPoint);                                                          // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/Task_StopMovement.Task_StopMovement_C
/// Size: 0x00B0 (176 bytes) (0x0000A8 - 0x0000B0) align 8 MaxSize: 0x00B0
class UTask_StopMovement_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_StopMovement.Task_StopMovement_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_StopMovement.Task_StopMovement_C.ExecuteUbergraph_Task_StopMovement
	// void ExecuteUbergraph_Task_StopMovement(int32_t EntryPoint);                                                             // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/Task_MoveToSniperSpot.Task_MoveToSniperSpot_C
/// Size: 0x00CD (205 bytes) (0x0000A8 - 0x0000CD) align 8 MaxSize: 0x00CD
class UTask_MoveToSniperSpot_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	bool                                               CanMoveToAnotherSpot;                                       // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x00B1   (0x0003)  MISSED
	float                                              LastTimeInSeconds;                                          // 0x00B4   (0x0004)  
	float                                              LocationAssignTime;                                         // 0x00B8   (0x0004)  
	float                                              TimeToStayAtLocation;                                       // 0x00BC   (0x0004)  
	FVector                                            SniperSpotLocation;                                         // 0x00C0   (0x000C)  
	bool                                               ArrivedAtLocation;                                          // 0x00CC   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_MoveToSniperSpot.Task_MoveToSniperSpot_C.OnFail_CBF0969A4CAED591B22A849AB75B60C2
	// void OnFail_CBF0969A4CAED591B22A849AB75B60C2(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToSniperSpot.Task_MoveToSniperSpot_C.OnSuccess_CBF0969A4CAED591B22A849AB75B60C2
	// void OnSuccess_CBF0969A4CAED591B22A849AB75B60C2(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToSniperSpot.Task_MoveToSniperSpot_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToSniperSpot.Task_MoveToSniperSpot_C.ExecuteUbergraph_Task_MoveToSniperSpot
	// void ExecuteUbergraph_Task_MoveToSniperSpot(int32_t EntryPoint);                                                         // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/Task_MoveToEnemy.Task_MoveToEnemy_C
/// Size: 0x00B0 (176 bytes) (0x0000A8 - 0x0000B0) align 8 MaxSize: 0x00B0
class UTask_MoveToEnemy_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_MoveToEnemy.Task_MoveToEnemy_C.OnFail_C93C33B54082C1FC2D0E29B13EEC1B53
	// void OnFail_C93C33B54082C1FC2D0E29B13EEC1B53(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToEnemy.Task_MoveToEnemy_C.OnSuccess_C93C33B54082C1FC2D0E29B13EEC1B53
	// void OnSuccess_C93C33B54082C1FC2D0E29B13EEC1B53(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToEnemy.Task_MoveToEnemy_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_MoveToEnemy.Task_MoveToEnemy_C.ExecuteUbergraph_Task_MoveToEnemy
	// void ExecuteUbergraph_Task_MoveToEnemy(int32_t EntryPoint);                                                              // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/Task_FindSniperSPot.Task_FindSniperSpot_C
/// Size: 0x00CD (205 bytes) (0x0000A8 - 0x0000CD) align 8 MaxSize: 0x00CD
class UTask_FindSniperSpot_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	bool                                               CanMoveToAnotherSpot;                                       // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x00B1   (0x0003)  MISSED
	float                                              LastTimeInSeconds;                                          // 0x00B4   (0x0004)  
	float                                              LocationAssignTime;                                         // 0x00B8   (0x0004)  
	float                                              TimeToStayAtLocation;                                       // 0x00BC   (0x0004)  
	FVector                                            SniperSpotLocation;                                         // 0x00C0   (0x000C)  
	bool                                               ArrivedAtLocation;                                          // 0x00CC   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_FindSniperSPot.Task_FindSniperSpot_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_FindSniperSPot.Task_FindSniperSpot_C.CustomEvent
	// void CustomEvent(class AAIController* OwnerController, class APawn* ControlledPawn);                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_FindSniperSPot.Task_FindSniperSpot_C.ExecuteUbergraph_Task_FindSniperSpot
	// void ExecuteUbergraph_Task_FindSniperSpot(int32_t EntryPoint);                                                           // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Characters/DamageDealerData.DamageDealerData_C
/// Size: 0x00D0 (208 bytes) (0x0000B0 - 0x0000D0) align 8 MaxSize: 0x00D0
class UDamageDealerData_C : public UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00B0   (0x0008)  
	int32_t                                            PlayerIndex;                                                // 0x00B8   (0x0004)  
	int32_t                                            TotalDamageAmount;                                          // 0x00BC   (0x0004)  
	class ABP_PlayerState_C*                           PlayerState;                                                // 0x00C0   (0x0008)  
	class APawn*                                       Pawn;                                                       // 0x00C8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Characters/DamageDealerData.DamageDealerData_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Characters/DamageDealerData.DamageDealerData_C.AddDamage
	// void AddDamage(int32_t Damage);                                                                                          // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/DamageDealerData.DamageDealerData_C.ExecuteUbergraph_DamageDealerData
	// void ExecuteUbergraph_DamageDealerData(int32_t EntryPoint);                                                              // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/Task_VehicleMoveToObjective.Task_VehicleMoveToObjective_C
/// Size: 0x00B0 (176 bytes) (0x0000A8 - 0x0000B0) align 8 MaxSize: 0x00B0
class UTask_VehicleMoveToObjective_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_VehicleMoveToObjective.Task_VehicleMoveToObjective_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_VehicleMoveToObjective.Task_VehicleMoveToObjective_C.ExecuteUbergraph_Task_VehicleMoveToObjective
	// void ExecuteUbergraph_Task_VehicleMoveToObjective(int32_t EntryPoint);                                                   // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/Task_VehicleMoveToEnemy.Task_VehicleMoveToEnemy_C
/// Size: 0x00B0 (176 bytes) (0x0000A8 - 0x0000B0) align 8 MaxSize: 0x00B0
class UTask_VehicleMoveToEnemy_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_VehicleMoveToEnemy.Task_VehicleMoveToEnemy_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_VehicleMoveToEnemy.Task_VehicleMoveToEnemy_C.ExecuteUbergraph_Task_VehicleMoveToEnemy
	// void ExecuteUbergraph_Task_VehicleMoveToEnemy(int32_t EntryPoint);                                                       // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/Task_RoamAround.Task_RoamAround_C
/// Size: 0x00B1 (177 bytes) (0x0000A8 - 0x0000B1) align 8 MaxSize: 0x00B1
class UTask_RoamAround_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	bool                                               CanMove;                                                    // 0x00B0   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_RoamAround.Task_RoamAround_C.OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C
	// void OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_RoamAround.Task_RoamAround_C.OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C
	// void OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_RoamAround.Task_RoamAround_C.OnFail_F0FCE4A041523E800C1D33BF41836500
	// void OnFail_F0FCE4A041523E800C1D33BF41836500(TEnumAsByte<EPathFollowingResult> MovementResult);                          // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_RoamAround.Task_RoamAround_C.OnSuccess_F0FCE4A041523E800C1D33BF41836500
	// void OnSuccess_F0FCE4A041523E800C1D33BF41836500(TEnumAsByte<EPathFollowingResult> MovementResult);                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_RoamAround.Task_RoamAround_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_RoamAround.Task_RoamAround_C.ExecuteUbergraph_Task_RoamAround
	// void ExecuteUbergraph_Task_RoamAround(int32_t EntryPoint);                                                               // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/Task_IsEnemyStillInLos.Task_IsEnemyStillInLos_C
/// Size: 0x00B8 (184 bytes) (0x0000A8 - 0x0000B8) align 8 MaxSize: 0x00B8
class UTask_IsEnemyStillInLos_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	float                                              TimeEnemyIsOutOfSight;                                      // 0x00B0   (0x0004)  
	float                                              LastTimeInSeconds;                                          // 0x00B4   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_IsEnemyStillInLos.Task_IsEnemyStillInLos_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                                // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_IsEnemyStillInLos.Task_IsEnemyStillInLos_C.ExecuteUbergraph_Task_IsEnemyStillInLos
	// void ExecuteUbergraph_Task_IsEnemyStillInLos(int32_t EntryPoint);                                                        // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C
/// Size: 0x00C0 (192 bytes) (0x0000A8 - 0x0000C0) align 8 MaxSize: 0x00C0
class UTask_FindObjective_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	bool                                               CanChangeDefendState;                                       // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x00B1   (0x0003)  MISSED
	float                                              DefendStateTimer;                                           // 0x00B4   (0x0004)  
	float                                              TimeToDefend;                                               // 0x00B8   (0x0004)  
	float                                              LastTimeInSeconds;                                          // 0x00BC   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C.IsObjectiveStillRelevant?
	// void IsObjectiveStillRelevant_(class APawn* Pawn, bool& StillRelevant);                                                  // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C.DoWeHaveAnObjective?
	// void DoWeHaveAnObjective_(class AActor* Pawn, bool& ValidObjective);                                                     // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C.GetTeamSupremacy
	// void GetTeamSupremacy(TEnumAsByte<E_Teams> Team, bool& Supremacy);                                                       // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C.GetDefendChance
	// void GetDefendChance(class APawn* ControlledPawn, bool& Defend, TEnumAsByte<E_AITeamPlayStyles>& PlayStyle);             // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C.IsCurrentObjectiveWon?
	// void IsCurrentObjectiveWon_(class AActor* PawnActor, bool& ObjectiveWon);                                                // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C.GetRandomObjective
	// void GetRandomObjective(class APawn* ControlledPawn, class ABP_SpawnableBase_C*& Objective);                             // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C.GetClosestObjective
	// void GetClosestObjective(class AActor* ControlledPawn, class ABP_SpawnableBase_C*& ClosestObjective);                    // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C.ReceiveTickAI
	// void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);               // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_FindObjective.Task_FindObjective_C.ExecuteUbergraph_Task_FindObjective
	// void ExecuteUbergraph_Task_FindObjective(int32_t EntryPoint);                                                            // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/AI/Task_CheckIfEnemyStillRelevant.Task_CheckIfEnemyStillRelevant_C
/// Size: 0x00B0 (176 bytes) (0x0000A8 - 0x0000B0) align 8 MaxSize: 0x00B0
class UTask_CheckIfEnemyStillRelevant_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/AI/Task_CheckIfEnemyStillRelevant.Task_CheckIfEnemyStillRelevant_C.ReceiveTickAI
	// void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);               // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/Task_CheckIfEnemyStillRelevant.Task_CheckIfEnemyStillRelevant_C.ExecuteUbergraph_Task_CheckIfEnemyStillRelevant
	// void ExecuteUbergraph_Task_CheckIfEnemyStillRelevant(int32_t EntryPoint);                                                // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/NavFilter_Tank.NavFilter_Tank_C
/// Size: 0x0048 (72 bytes) (0x000048 - 0x000048) align 8 MaxSize: 0x0048
class UNavFilter_Tank_C : public UNavFilter_AIControllerDefault
{ 
public:
};

/// Class /Game/Blueprints/Vehicles/BP_VehicleRepairZone.BP_VehicleRepairZone_C
/// Size: 0x0231 (561 bytes) (0x000220 - 0x000231) align 8 MaxSize: 0x0231
class ABP_VehicleRepairZone_C : public AActor
{ 
public:
	class UBoxComponent*                               Box;                                                        // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	TEnumAsByte<E_Teams>                               Team;                                                       // 0x0230   (0x0001)  
};

/// Class /Game/Blueprints/Characters/BP_Username.BP_Username_C
/// Size: 0x0260 (608 bytes) (0x000220 - 0x000260) align 8 MaxSize: 0x0260
class ABP_Username_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UWidgetComponent*                            UsernameWidget;                                             // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	bool                                               CanBeSeen;                                                  // 0x0238   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0239   (0x0007)  MISSED
	class APawn*                                       PawnRef;                                                    // 0x0240   (0x0008)  
	class UPawnDataComponent_C*                        PawnDataComponent;                                          // 0x0248   (0x0008)  
	TArray<class APawn*>                               PawnsToIgnore;                                              // 0x0250   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/Characters/BP_Username.BP_Username_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Username.BP_Username_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Username.BP_Username_C.ExecuteUbergraph_BP_Username
	// void ExecuteUbergraph_BP_Username(int32_t EntryPoint);                                                                   // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/BP_WaterPlane.BP_WaterPlane_C
/// Size: 0x0240 (576 bytes) (0x000220 - 0x000240) align 8 MaxSize: 0x0240
class ABP_WaterPlane_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UStaticMeshComponent*                        WaterPlane;                                                 // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	class UMaterialInstance*                           WaterTexture;                                               // 0x0238   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/BP_WaterPlane.BP_WaterPlane_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x1325ea0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_WaterPlane.BP_WaterPlane_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/BP_WaterPlane.BP_WaterPlane_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/BP_WaterPlane.BP_WaterPlane_C.SetWaterMaterial
	// void SetWaterMaterial();                                                                                                 // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_WaterPlane.BP_WaterPlane_C.ExecuteUbergraph_BP_WaterPlane
	// void ExecuteUbergraph_BP_WaterPlane(int32_t EntryPoint);                                                                 // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Functions/AIFunctions.AIFunctions_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UAIFunctions_C : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Game/Blueprints/Functions/AIFunctions.AIFunctions_C.LockToEnemy
	// void LockToEnemy(class APawn* EnemyPawn, class APawn* OwnPawn, bool PrioritizeArmoredVehicles, bool ForceLock, class UObject* __WorldContext); // [0x1325ea0] Static|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/AIFunctions.AIFunctions_C.EngageEnemy
	// void EngageEnemy(class UObject* EnemyObject, class APawn* OwnPawn, bool PrioritizeVehicles, bool CanAttackArmoredVehicles, bool CanAttackPlanes, bool PrioritizeThistarget_ForceLock_, class UObject* __WorldContext, bool& Engaging); // [0x1325ea0] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/Characters/BP_SpectatorCam.BP_SpectatorCam_C
/// Size: 0x02A0 (672 bytes) (0x000280 - 0x0002A0) align 8 MaxSize: 0x02A0
class ABP_SpectatorCam_C : public APawn
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	class UCameraComponent*                            Camera;                                                     // 0x0288   (0x0008)  
	class USpringArmComponent*                         SpringArm;                                                  // 0x0290   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0298   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Characters/BP_SpectatorCam.BP_SpectatorCam_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_SpectatorCam.BP_SpectatorCam_C.InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent
	// void InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent(float AxisValue);                                                     // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Characters/BP_SpectatorCam.BP_SpectatorCam_C.InpAxisKeyEvt_MouseY_K2Node_InputAxisKeyEvent
	// void InpAxisKeyEvt_MouseY_K2Node_InputAxisKeyEvent(float AxisValue);                                                     // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Characters/BP_SpectatorCam.BP_SpectatorCam_C.ExecuteUbergraph_BP_SpectatorCam
	// void ExecuteUbergraph_BP_SpectatorCam(int32_t EntryPoint);                                                               // [0x1325ea0] Final|HasDefaults    
};

/// Struct /Game/Blueprints/CosmeticItems/ST_CharacterCustomization.ST_CharacterCustomization
/// Size: 0x004C (76 bytes) (0x000000 - 0x00004C) align 4 MaxSize: 0x004C
struct FST_CharacterCustomization
{ 
	int32_t                                            FacialHair_4_1D86C80448E0F97004E123B5C0913B28;              // 0x0000   (0x0004)  
	int32_t                                            HairColor_7_6EF03A46455473896828BB9E5F517582;               // 0x0004   (0x0004)  
	float                                              SkinTone_11_4AE8A93942C69DB4C74AC9A56C014267;               // 0x0008   (0x0004)  
	int32_t                                            Hat_17_90C67EDB4DF9ED1BCAFE52B82DA970BC;                    // 0x000C   (0x0004)  
	int32_t                                            UpperFaceItem_18_922C8DBE42D17CDA30BCCDA50CC01601;          // 0x0010   (0x0004)  
	int32_t                                            LowerFaceItem_20_6B068D3D4E2C3F65103028A959DC0B42;          // 0x0014   (0x0004)  
	int32_t                                            Legs_33_E4592CB647BE5A9AA859CF9C62EB58F9;                   // 0x0018   (0x0004)  
	int32_t                                            HairStyle_25_010B88E14233BA2210CA0190F020221F;              // 0x001C   (0x0004)  
	int32_t                                            Shirt_28_3022BF614735B4DF0E3F6E9CD51B7C66;                  // 0x0020   (0x0004)  
	int32_t                                            Underwear_30_683D84E44BB9362A6C8F56BB69132332;              // 0x0024   (0x0004)  
	int32_t                                            Torso_32_D5F6FA3548FEA662CDF2919341A800B1;                  // 0x0028   (0x0004)  
	int32_t                                            Hands_35_6DF487E24D357797494342B1DFECBD85;                  // 0x002C   (0x0004)  
	int32_t                                            Feet_37_31B1A2F0421CC3E54F0F36A401C716F4;                   // 0x0030   (0x0004)  
	int32_t                                            Tattoo_39_150ABB9D4FBFBBDEEC1127BEBF9383FF;                 // 0x0034   (0x0004)  
	int32_t                                            Back_41_8C736279451D47CB398D7F856427A6F3;                   // 0x0038   (0x0004)  
	int32_t                                            Waist_44_92BABF33482CE8F2A7CF6F8685BBD90E;                  // 0x003C   (0x0004)  
	TEnumAsByte<E_Teams>                               Team_47_38C05D7E4006D451A4CA64A7A8DA0C8D;                   // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0041   (0x0003)  MISSED
	int32_t                                            EyeColor_50_6237D4AA4BA6A3712B9486AACF86D21F;               // 0x0044   (0x0004)  
	int32_t                                            Title_53_60610D5F45C0C130EB600998AEE09F71;                  // 0x0048   (0x0004)  
};

/// Class /Game/Blueprints/Characters/BP_MugShotDummy.BP_MugShotDummy_C
/// Size: 0x0309 (777 bytes) (0x000220 - 0x000309) align 8 MaxSize: 0x0309
class ABP_MugShotDummy_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USkeletalMeshComponent*                      Back;                                                       // 0x0228   (0x0008)  
	class USkeletalMeshComponent*                      CharacterMesh_Back;                                         // 0x0230   (0x0008)  
	class USceneCaptureComponent2D*                    SceneCapture_Back;                                          // 0x0238   (0x0008)  
	class USkeletalMeshComponent*                      HatSkeletal;                                                // 0x0240   (0x0008)  
	class USkeletalMeshComponent*                      LowerFaceSkeletal;                                          // 0x0248   (0x0008)  
	class USpotLightComponent*                         SpotLight1;                                                 // 0x0250   (0x0008)  
	class USpotLightComponent*                         SpotLight;                                                  // 0x0258   (0x0008)  
	class USceneCaptureComponent2D*                    SceneCapture_Front;                                         // 0x0260   (0x0008)  
	class USkeletalMeshComponent*                      Torso;                                                      // 0x0268   (0x0008)  
	class USkeletalMeshComponent*                      FacialHair;                                                 // 0x0270   (0x0008)  
	class UStaticMeshComponent*                        LowerFace;                                                  // 0x0278   (0x0008)  
	class UStaticMeshComponent*                        UpperFace;                                                  // 0x0280   (0x0008)  
	class UStaticMeshComponent*                        Hat;                                                        // 0x0288   (0x0008)  
	class USkeletalMeshComponent*                      CharacterMesh_Front;                                        // 0x0290   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0298   (0x0008)  
	TEnumAsByte<E_Teams>                               Team;                                                       // 0x02A0   (0x0001)  
	TEnumAsByte<E_Units>                               Class;                                                      // 0x02A1   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x02A2   (0x0002)  MISSED
	FST_CharacterCustomization                         CharCustomization;                                          // 0x02A4   (0x004C)  
	class UStaticMesh*                                 ShowCaseHatItem;                                            // 0x02F0   (0x0008)  
	class USkeletalMesh*                               ShowCaseTorsoItem;                                          // 0x02F8   (0x0008)  
	class USkeletalMesh*                               ShowCaseBackItem;                                           // 0x0300   (0x0008)  
	bool                                               EnableCustomization;                                        // 0x0308   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Characters/BP_MugShotDummy.BP_MugShotDummy_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x1325ea0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_MugShotDummy.BP_MugShotDummy_C.SetCustomization
	// void SetCustomization(FST_CharacterCustomization& Customization);                                                        // [0x1325ea0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_MugShotDummy.BP_MugShotDummy_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_MugShotDummy.BP_MugShotDummy_C.Init
	// void Init();                                                                                                             // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_MugShotDummy.BP_MugShotDummy_C.ExecuteUbergraph_BP_MugShotDummy
	// void ExecuteUbergraph_BP_MugShotDummy(int32_t EntryPoint);                                                               // [0x1325ea0] Final|HasDefaults    
};

/// Struct /Game/Blueprints/Structs/ST_DamageInformation.ST_DamageInformation
/// Size: 0x0012 (18 bytes) (0x000000 - 0x000012) align 8 MaxSize: 0x0012
struct FST_DamageInformation
{ 
	TEnumAsByte<E_DamageTypes>                         DamageType_14_24A5476544D892D78E480591D5422978;             // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            DamageAmount_6_91E4428043CDFA47C65F29937A1C6484;            // 0x0004   (0x0004)  
	class AActor*                                      HitActor_9_66F4D8A7496E278CC30CFCB3F0251F9F;                // 0x0008   (0x0008)  
	bool                                               IsCriticalHit_7_3366509743A2E7E17BFCB59F64CC6784;           // 0x0010   (0x0001)  
	bool                                               IsLowHP_10_779ADF5C41BCF67BFB105485BDA2E805;                // 0x0011   (0x0001)  
};

/// Class /Game/Blueprints/Characters/BP_DamageNumberNew.BP_DamageNumberNew_C
/// Size: 0x0258 (600 bytes) (0x000220 - 0x000258) align 8 MaxSize: 0x0258
class ABP_DamageNumberNew_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UWidgetComponent*                            Widget;                                                     // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	FST_DamageInformation                              DamageInfo;                                                 // 0x0238   (0x0012)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x024A   (0x0006)  MISSED
	class UClass*                                      EquipableClass;                                             // 0x0250   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Characters/BP_DamageNumberNew.BP_DamageNumberNew_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_DamageNumberNew.BP_DamageNumberNew_C.IncreaseDamageNumber
	// void IncreaseDamageNumber(int32_t IncreaseAmount);                                                                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_DamageNumberNew.BP_DamageNumberNew_C.ExecuteUbergraph_BP_DamageNumberNew
	// void ExecuteUbergraph_BP_DamageNumberNew(int32_t EntryPoint);                                                            // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/BP_WorldDamageNumber.BP_WorldDamageNumber_C
/// Size: 0x0253 (595 bytes) (0x000220 - 0x000253) align 8 MaxSize: 0x0253
class ABP_WorldDamageNumber_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UWidgetComponent*                            Widget;                                                     // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	bool                                               CriticalHit;                                                // 0x0238   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0239   (0x0003)  MISSED
	int32_t                                            DamageAmount;                                               // 0x023C   (0x0004)  
	float                                              RandomHorizontalOffset;                                     // 0x0240   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0244   (0x0004)  MISSED
	class AActor*                                      HitActor;                                                   // 0x0248   (0x0008)  
	bool                                               IsLow;                                                      // 0x0250   (0x0001)  
	bool                                               IsWithinView;                                               // 0x0251   (0x0001)  
	TEnumAsByte<E_DamageTypes>                         DamageType;                                                 // 0x0252   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/BP_WorldDamageNumber.BP_WorldDamageNumber_C.DamageNumberEnded
	// void DamageNumberEnded();                                                                                                // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_WorldDamageNumber.BP_WorldDamageNumber_C.AddDamage
	// void AddDamage(FST_DamageInformation DamageInfo);                                                                        // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_WorldDamageNumber.BP_WorldDamageNumber_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/BP_WorldDamageNumber.BP_WorldDamageNumber_C.ExecuteUbergraph_BP_WorldDamageNumber
	// void ExecuteUbergraph_BP_WorldDamageNumber(int32_t EntryPoint);                                                          // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/BP_PlayerCameraManager.BP_PlayerCameraManager_C
/// Size: 0x2810 (10256 bytes) (0x002810 - 0x002810) align 16 MaxSize: 0x2810
class ABP_PlayerCameraManager_C : public APlayerCameraManager
{ 
public:
};

/// Class /Game/Blueprints/BP_CombatZone.BP_CombatZone_C
/// Size: 0x0231 (561 bytes) (0x000220 - 0x000231) align 8 MaxSize: 0x0231
class ABP_CombatZone_C : public AActor
{ 
public:
	class UBoxComponent*                               Box;                                                        // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	TEnumAsByte<E_CombatZoneTypes>                     ZoneType;                                                   // 0x0230   (0x0001)  
};

/// Class /Game/Blueprints/Cameras/BP_MainMenuCam.BP_MainMenuCam_C
/// Size: 0x0290 (656 bytes) (0x000280 - 0x000290) align 8 MaxSize: 0x0290
class ABP_MainMenuCam_C : public APawn
{ 
public:
	class UCameraComponent*                            Camera;                                                     // 0x0280   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0288   (0x0008)  
};

/// Struct /Game/Blueprints/Structs/ST_Unlockable.ST_Unlockable
/// Size: 0x0188 (392 bytes) (0x000000 - 0x000188) align 8 MaxSize: 0x0188
struct FST_Unlockable
{ 
	bool                                               Enabled_180_A5BB547F461F23A380B968A57C641911;               // 0x0000   (0x0001)  
	TEnumAsByte<E_UnlockableCategories>                Category_20_ED4E862040731943218B179172C69884;               // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0002   (0x0006)  MISSED
	FText                                              Name_2_676B704547B5547E12D39A9E2D4B7A7C;                    // 0x0008   (0x0018)  
	TEnumAsByte<E_CurrencyTypes>                       CurrencyType_112_40655FA74DE5301720ABFC90C2543A40;          // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0021   (0x0003)  MISSED
	int32_t                                            RequiredAmount_113_7112AC53455EDD997907FFACCE797B2C;        // 0x0024   (0x0004)  
	FDataTableRowHandle                                TokenEvent_255_DF115470478F85916FCB30976F86CFBB;            // 0x0028   (0x0010)  
	int32_t                                            LinkedSteamPurchaseItem_270_73A0DB7742B895B6ED11419C4922D08F; // 0x0038   (0x0004)  
	int32_t                                            LinkedSteamGenerator_269_0C38B23E46469545FF9A539A744AE8D3;  // 0x003C   (0x0004)  
	FDataTableRowHandle                                RequiredPrivilegeDLC_249_F109ECFC4F56924B5583D8AE0B3A4CAA;  // 0x0040   (0x0010)  
	int32_t                                            Season_261_1C025506486A1ECA8ED68089C9F1657D;                // 0x0050   (0x0004)  
	TEnumAsByte<E_SteamItemRarities>                   Rarity_223_023B74484A386B0FFBA9FAAD1484D24F;                // 0x0054   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0055   (0x0003)  MISSED
	SDK_UNDEFINED(16,612) /* TArray<TEnumAsByte<E_Teams>> */ __um(Teams_117_648E79674D3BE3250F06329D2ACE2925);     // 0x0058   (0x0010)  
	SDK_UNDEFINED(16,613) /* TArray<TEnumAsByte<E_Units>> */ __um(ClassesLeaveemptyforallclasses_158_3AEA29284AA2E1CCE304C5AD22AE9159); // 0x0068   (0x0010)  
	class UTexture2D*                                  Icon_5_58E515F64D01356B55F390A5C4580E03;                    // 0x0078   (0x0008)  
	class UMaterialInstance*                           Material1_131_36CCBEAE4701A6C22997C6B6955E0A17;             // 0x0080   (0x0008)  
	class UMaterialInstance*                           Material2_130_0F9F8B35447A090E6E2D2D82F3A6C476;             // 0x0088   (0x0008)  
	class USkeletalMesh*                               SkeletalMesh1_184_342E4AD249D58BFE5924469B595F7677;         // 0x0090   (0x0008)  
	class USkeletalMesh*                               SkeletalMesh2_183_23A807D64CA714AD2C1F33A1AD9744AE;         // 0x0098   (0x0008)  
	class UStaticMesh*                                 StaticMesh1_132_88E33CE340E7D23EAAAD989E1043B3CD;           // 0x00A0   (0x0008)  
	class UStaticMesh*                                 StaticMesh2_133_7712B7364386ED0221C92585BD02B59F;           // 0x00A8   (0x0008)  
	bool                                               OverrideHair_311_781BA6FB4854D8956D6395B0C0F0D2DD;          // 0x00B0   (0x0001)  
	bool                                               OverrideFacialHair_146_6486C1084B0662CEDAA26A8A476F0F6C;    // 0x00B1   (0x0001)  
	bool                                               OverrideUpperFace_153_B3D818D0401A6DD3796049BA654B20D7;     // 0x00B2   (0x0001)  
	bool                                               OverrideLowerFace_151_A096E98B477707E636B2159F12288600;     // 0x00B3   (0x0001)  
	bool                                               OverrideLegs_147_C6045E1A466E65B574AD928BB18C1B7B;          // 0x00B4   (0x0001)  
	bool                                               OverrideFeet_149_99DA52AE4C9D1A27C165959B0E541664;          // 0x00B5   (0x0001)  
	bool                                               OverrideBack_207_6D900B7243362389D800359078CF5588;          // 0x00B6   (0x0001)  
	bool                                               OverrideEyebrows_288_8C47497943619327BB55869A896640D8;      // 0x00B7   (0x0001)  
	bool                                               UseHairColorHatHair_292_7C271A3C4D38F551181EB5A44D0C11E7;   // 0x00B8   (0x0001)  
	bool                                               UseThinUpperLegsCoversUpperLegsTorso_281_9B5DCA934EEED051EEE2D7AE7D072792; // 0x00B9   (0x0001)  
	bool                                               EnableStrapsTorso_233_5B7AD00A46B6E2231C712AB60B7022B5;     // 0x00BA   (0x0001)  
	bool                                               UseBodyStrapsInsteadOfTorsoTorso_283_618A38394EEC1FF49B86E3A5B2582C34; // 0x00BB   (0x0001)  
	bool                                               UseWaistItemOffsetTorso_282_7894B9B3407F34058F5555977D0ED10F; // 0x00BC   (0x0001)  
	bool                                               HideUnderLongTorsoItemLegs_280_D25B1D8345E0AFC0C75FF7886A1AF60C; // 0x00BD   (0x0001)  
	bool                                               CoversShoesLegs_238_458F472F403C6A6B2F52A88292797A7A;       // 0x00BE   (0x0001)  
	bool                                               ColorTattooWithSkinColorTattoo_308_994E71EF4E8A08433BFBD08515C249D5; // 0x00BF   (0x0001)  
	float                                              UpperLegBoneThicknessLegs_303_36EF19854882FB728C7B739C4D82DD89; // 0x00C0   (0x0004)  
	float                                              LowerLegBoneThicknessLegs_305_6F408074410FA49ED134EE8E62EF6678; // 0x00C4   (0x0004)  
	float                                              CharacterHeightOffsetFeet_304_E0F266AC42637AA98FA4B6BE689FC308; // 0x00C8   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x00CC   (0x0004)  MISSED
	class UTexture2D*                                  Texture1_136_22F99B0F4EE096A1CD82008F1CD58AD5;              // 0x00D0   (0x0008)  
	class UTexture2D*                                  Texture2_138_8EEBDB414937EA2161EB4887DEE7C1D3;              // 0x00D8   (0x0008)  
	class UTexture2D*                                  Texture3_197_435B8FF04A7DEDC34DFCE3A933BE0A81;              // 0x00E0   (0x0008)  
	class UTexture2D*                                  Texture4_216_284F872C49772CFC70AFC59B5E35E290;              // 0x00E8   (0x0008)  
	bool                                               ColorizeIcon_244_24C92104428058C13E8F758003408B7B;          // 0x00F0   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x00F1   (0x0003)  MISSED
	FLinearColor                                       ColorOverlay1_198_F33304FC4503E80449BD1FACA52AD648;         // 0x00F4   (0x0010)  
	FLinearColor                                       ColorOverlay2_201_08447861431E271F2CFD3795B6C64811;         // 0x0104   (0x0010)  
	FLinearColor                                       ColorOverlay3_204_910AE763485340E6516EE6965735CF75;         // 0x0114   (0x0010)  
	int32_t                                            UVCoordinateOnCharacter_231_226735B448670893D9F8D48D71F29C2E; // 0x0124   (0x0004)  
	class UAnimMontage*                                AnimMontage_124_B3141DC7470AE940B93E0B91BFCAF8C3;           // 0x0128   (0x0008)  
	class UClass*                                      BlueprintRef_122_D3AEC4A74F179CA08EC909984F4A2B10;          // 0x0130   (0x0008)  
	FLinearColor                                       FlatColor_WeaponSkin_96_0166CF874F05BAB0154B2D8CE7F23E9B;   // 0x0138   (0x0010)  
	class UTexture2D*                                  Texture_WeaponSkin_76_FBBFB9E24CCB1D04A19ACC8C24859526;     // 0x0148   (0x0008)  
	FLinearColor                                       TipColor_WeaponSkin_81_564A836541C56E22033AA589B5F742CE;    // 0x0150   (0x0010)  
	float                                              SkinTileAmount_85_1CB964184E148B2419AB20AEA50E7B8D;         // 0x0160   (0x0004)  
	bool                                               Dontfliptexturesonmainlywoodenweapon_WeaponSkin_178_9372B6104002326730FF26BF158D2015; // 0x0164   (0x0001)  
	bool                                               Usetextureoverentireweapon_WeaponSkin_WeaponSkin_109_CF75BE5A4C22488310BB30B0BC1B34D6; // 0x0165   (0x0001)  
	unsigned char                                      UnknownData05_6[0x2];                                       // 0x0166   (0x0002)  MISSED
	float                                              Roughness_WeaponSkin_161_52F57CD047AE4AF6BD7E38AEEBCE1001;  // 0x0168   (0x0004)  
	float                                              Metalness_WeaponSkin_163_F28502B54A76AEF3048B37935292B749;  // 0x016C   (0x0004)  
	float                                              Specular_WeaponSkin_165_F7EACCEA4669CB01620F4FBE6DECB277;   // 0x0170   (0x0004)  
	float                                              Emmissive_WeaponSkin_168_C054CD8E465F6A95CB7C2785CBAA3F6D;  // 0x0174   (0x0004)  
	FLinearColor                                       FresnelColor_WeaponSkin_177_9F65036549E6D5919B491CA23F3ED0D2; // 0x0178   (0x0010)  
};

/// Class /Game/Blueprints/BP_CosmeticPreview.BP_CosmeticPreview_C
/// Size: 0x0400 (1024 bytes) (0x000220 - 0x000400) align 8 MaxSize: 0x0400
class ABP_CosmeticPreview_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UStaticMeshComponent*                        Plane;                                                      // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0230   (0x0008)  
	class UArrowComponent*                             Arrow;                                                      // 0x0238   (0x0008)  
	class USpotLightComponent*                         SpotLight;                                                  // 0x0240   (0x0008)  
	class USceneCaptureComponent2D*                    SceneCaptureComponent2D;                                    // 0x0248   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0250   (0x0008)  
	FST_Unlockable                                     Item;                                                       // 0x0258   (0x0188)  
	class UMaterialInstanceDynamic*                    WeaponTextureMID;                                           // 0x03E0   (0x0008)  
	class UMaterialInstanceDynamic*                    WeaponFlatColorMID;                                         // 0x03E8   (0x0008)  
	int32_t                                            MeshCycleIndex;                                             // 0x03F0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x03F4   (0x0004)  MISSED
	class UStaticMesh*                                 MeshToLoad;                                                 // 0x03F8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/BP_CosmeticPreview.BP_CosmeticPreview_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x1325ea0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_CosmeticPreview.BP_CosmeticPreview_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/BP_CosmeticPreview.BP_CosmeticPreview_C.LoadItem
	// void LoadItem();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_CosmeticPreview.BP_CosmeticPreview_C.CycleMeshUp
	// void CycleMeshUp();                                                                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_CosmeticPreview.BP_CosmeticPreview_C.ReloadWeaponSkin
	// void ReloadWeaponSkin();                                                                                                 // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_CosmeticPreview.BP_CosmeticPreview_C.ExecuteUbergraph_BP_CosmeticPreview
	// void ExecuteUbergraph_BP_CosmeticPreview(int32_t EntryPoint);                                                            // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C
/// Size: 0x0322 (802 bytes) (0x000220 - 0x000322) align 8 MaxSize: 0x0322
class ABP_Mannequin_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USkeletalMeshComponent*                      GlovesSkeletal;                                             // 0x0228   (0x0008)  
	class USkeletalMeshComponent*                      HatSkeletal;                                                // 0x0230   (0x0008)  
	class USkeletalMeshComponent*                      LowerFaceSkeletal;                                          // 0x0238   (0x0008)  
	class USkeletalMeshComponent*                      Waist;                                                      // 0x0240   (0x0008)  
	class USkeletalMeshComponent*                      Feet;                                                       // 0x0248   (0x0008)  
	class USkeletalMeshComponent*                      Back;                                                       // 0x0250   (0x0008)  
	class USkeletalMeshComponent*                      Torso;                                                      // 0x0258   (0x0008)  
	class USkeletalMeshComponent*                      FacialHair;                                                 // 0x0260   (0x0008)  
	class USkeletalMeshComponent*                      Legs;                                                       // 0x0268   (0x0008)  
	class UStaticMeshComponent*                        LowerFace;                                                  // 0x0270   (0x0008)  
	class UStaticMeshComponent*                        HatExtras;                                                  // 0x0278   (0x0008)  
	class UStaticMeshComponent*                        UpperFace;                                                  // 0x0280   (0x0008)  
	class UChildActorComponent*                        Weapon;                                                     // 0x0288   (0x0008)  
	class UStaticMeshComponent*                        Hat;                                                        // 0x0290   (0x0008)  
	class USkeletalMeshComponent*                      CharacterMesh;                                              // 0x0298   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02A0   (0x0008)  
	float                                              Timeline_0_NewTrack_0_B468E7C94729808A51102E94678BD34A;     // 0x02A8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_B468E7C94729808A51102E94678BD34A;     // 0x02AC   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x02AD   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x02B0   (0x0008)  
	TEnumAsByte<E_Teams>                               Team;                                                       // 0x02B8   (0x0001)  
	TEnumAsByte<E_Units>                               Class;                                                      // 0x02B9   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x02BA   (0x0002)  MISSED
	FST_CharacterCustomization                         CharCustomization;                                          // 0x02BC   (0x004C)  
	class UStaticMesh*                                 ShowCaseHatItem;                                            // 0x0308   (0x0008)  
	class USkeletalMesh*                               ShowCaseTorsoItem;                                          // 0x0310   (0x0008)  
	class USkeletalMesh*                               ShowCaseBackItem;                                           // 0x0318   (0x0008)  
	bool                                               EnableCustomization;                                        // 0x0320   (0x0001)  
	bool                                               EnableWeaponPoseOverride;                                   // 0x0321   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x1325ea0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.Timeline_0__FinishedFunc
	// void Timeline_0__FinishedFunc();                                                                                         // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.Timeline_0__UpdateFunc
	// void Timeline_0__UpdateFunc();                                                                                           // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.SetClass
	// void SetClass(TEnumAsByte<E_Units> Class);                                                                               // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.SetActiveWeaponSkin
	// void SetActiveWeaponSkin();                                                                                              // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.ApplyCharCustomization
	// void ApplyCharCustomization();                                                                                           // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.RefreshShowcaseCosmetics
	// void RefreshShowcaseCosmetics();                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.SetTeam
	// void SetTeam(TEnumAsByte<E_Teams> Team);                                                                                 // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.DisableWeaponUseParentBounds
	// void DisableWeaponUseParentBounds();                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.SetWeaponDisplayMode
	// void SetWeaponDisplayMode(bool ShowWeapon);                                                                              // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin.BP_Mannequin_C.ExecuteUbergraph_BP_Mannequin
	// void ExecuteUbergraph_BP_Mannequin(int32_t EntryPoint);                                                                  // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Characters/BP_Mannequin_Axis.BP_Mannequin_Axis_C
/// Size: 0x0330 (816 bytes) (0x000322 - 0x000330) align 8 MaxSize: 0x0330
class ABP_Mannequin_Axis_C : public ABP_Mannequin_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x6];                                       // 0x0322   (0x0006)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0328   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Characters/BP_Mannequin_Axis.BP_Mannequin_Axis_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Characters/BP_Mannequin_Axis.BP_Mannequin_Axis_C.ExecuteUbergraph_BP_Mannequin_Axis
	// void ExecuteUbergraph_BP_Mannequin_Axis(int32_t EntryPoint);                                                             // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/BP_EquipPreview.BP_EquipPreview_C
/// Size: 0x0238 (568 bytes) (0x000220 - 0x000238) align 8 MaxSize: 0x0238
class ABP_EquipPreview_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UChildActorComponent*                        Mannequin;                                                  // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/BP_EquipPreview.BP_EquipPreview_C.LoadActor
	// void LoadActor(class UClass* ActorClass);                                                                                // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_EquipPreview.BP_EquipPreview_C.SetTeam
	// void SetTeam(TEnumAsByte<E_Teams> Team);                                                                                 // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_EquipPreview.BP_EquipPreview_C.ExecuteUbergraph_BP_EquipPreview
	// void ExecuteUbergraph_BP_EquipPreview(int32_t EntryPoint);                                                               // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/AI/NavArea_Vehicle.NavArea_Vehicle_C
/// Size: 0x0048 (72 bytes) (0x000048 - 0x000048) align 8 MaxSize: 0x0048
class UNavArea_Vehicle_C : public UNavArea
{ 
public:
};

/// Class /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C
/// Size: 0x024C (588 bytes) (0x000220 - 0x00024C) align 8 MaxSize: 0x024C
class ABP_SkillBase_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	class ABP_Character_C*                             Character;                                                  // 0x0230   (0x0008)  
	TEnumAsByte<E_SkillSlots>                          SkillSlot;                                                  // 0x0238   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0239   (0x0003)  MISSED
	float                                              SkillCooldown;                                              // 0x023C   (0x0004)  
	float                                              SkillDuration;                                              // 0x0240   (0x0004)  
	float                                              SkillTimeThatHasPassed;                                     // 0x0244   (0x0004)  
	bool                                               RunSkillTime;                                               // 0x0248   (0x0001)  
	bool                                               RemainActiveInVehicle;                                      // 0x0249   (0x0001)  
	bool                                               EndActiveSkillsUponUse;                                     // 0x024A   (0x0001)  
	bool                                               AttachToPlayer;                                             // 0x024B   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.OnRep_Character
	// void OnRep_Character();                                                                                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.RechargeSkill
	// void RechargeSkill();                                                                                                    // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.EndSkill
	// void EndSkill();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.BeginSkillDuration
	// void BeginSkillDuration();                                                                                               // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.CharacterSet
	// void CharacterSet();                                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.ReduceSkillDuration
	// void ReduceSkillDuration(float Amount);                                                                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.EndSkillFromCharacter
	// void EndSkillFromCharacter();                                                                                            // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_SkillBase.BP_SkillBase_C.ExecuteUbergraph_BP_SkillBase
	// void ExecuteUbergraph_BP_SkillBase(int32_t EntryPoint);                                                                  // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Skills/BP_Skill_Shield.BP_Skill_Shield_C
/// Size: 0x0278 (632 bytes) (0x00024C - 0x000278) align 8 MaxSize: 0x0278
class ABP_Skill_Shield_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	TArray<class AActor*>                              ShieldedCharacters;                                         // 0x0258   (0x0010)  
	TArray<class ABP_BuffDebuffBase_C*>                Shields;                                                    // 0x0268   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_Shield.BP_Skill_Shield_C.CheckIfPlayerIsAlreadyShielded
	// void CheckIfPlayerIsAlreadyShielded(class ABP_Character_C* Character, bool& AlreadyShielded, class ABP_Shield_C*& AsBPShield); // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Skills/BP_Skill_Shield.BP_Skill_Shield_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Shield.BP_Skill_Shield_C.EndSkill
	// void EndSkill();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Shield.BP_Skill_Shield_C.OwnShieldDestroyed
	// void OwnShieldDestroyed();                                                                                               // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Shield.BP_Skill_Shield_C.ExecuteUbergraph_BP_Skill_Shield
	// void ExecuteUbergraph_BP_Skill_Shield(int32_t EntryPoint);                                                               // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Skills/BP_Skill_PowerShot.BP_Skill_PowerShot_C
/// Size: 0x0274 (628 bytes) (0x00024C - 0x000274) align 8 MaxSize: 0x0274
class ABP_Skill_PowerShot_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	class UParticleSystemComponent*                    ParticleSystem;                                             // 0x0258   (0x0008)  
	bool                                               CanEnd;                                                     // 0x0260   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0261   (0x0007)  MISSED
	class UM_PiercingShotScreenEffect_C*               HUDEffect;                                                  // 0x0268   (0x0008)  
	int32_t                                            BonusDamageAmount;                                          // 0x0270   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_PowerShot.BP_Skill_PowerShot_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PowerShot.BP_Skill_PowerShot_C.ReceiveDestroyed
	// void ReceiveDestroyed();                                                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PowerShot.BP_Skill_PowerShot_C.CharacterSet
	// void CharacterSet();                                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PowerShot.BP_Skill_PowerShot_C.WeaponFired
	// void WeaponFired();                                                                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PowerShot.BP_Skill_PowerShot_C.ExecuteUbergraph_BP_Skill_PowerShot
	// void ExecuteUbergraph_BP_Skill_PowerShot(int32_t EntryPoint);                                                            // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Skills/BP_Skill_PowerClap.BP_Skill_PowerClap_C
/// Size: 0x0270 (624 bytes) (0x00024C - 0x000270) align 8 MaxSize: 0x0270
class ABP_Skill_PowerClap_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	float                                              BlastRadius;                                                // 0x0258   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x025C   (0x0004)  MISSED
	TArray<class AActor*>                              PushedActors;                                               // 0x0260   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_PowerClap.BP_Skill_PowerClap_C.GetForceAmount
	// void GetForceAmount(FVector EnemyLocation, FVector OwnLocation, FVector& Force);                                         // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Skills/BP_Skill_PowerClap.BP_Skill_PowerClap_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PowerClap.BP_Skill_PowerClap_C.MC_BlastingStrikeEffects
	// void MC_BlastingStrikeEffects();                                                                                         // [0x1325ea0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PowerClap.BP_Skill_PowerClap_C.ExecuteUbergraph_BP_Skill_PowerClap
	// void ExecuteUbergraph_BP_Skill_PowerClap(int32_t EntryPoint);                                                            // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Skills/BP_Skill_PowderKeg.BP_Skill_PowderKeg_C
/// Size: 0x0264 (612 bytes) (0x00024C - 0x000264) align 8 MaxSize: 0x0264
class ABP_Skill_PowderKeg_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	FVector                                            ThrowDirection;                                             // 0x0258   (0x000C)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_PowderKeg.BP_Skill_PowderKeg_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PowderKeg.BP_Skill_PowderKeg_C.ExecuteUbergraph_BP_Skill_PowderKeg
	// void ExecuteUbergraph_BP_Skill_PowderKeg(int32_t EntryPoint);                                                            // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Skills/BP_Skill_PoisonTrap.BP_Skill_PoisonTrap_C
/// Size: 0x0258 (600 bytes) (0x00024C - 0x000258) align 8 MaxSize: 0x0258
class ABP_Skill_PoisonTrap_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_PoisonTrap.BP_Skill_PoisonTrap_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PoisonTrap.BP_Skill_PoisonTrap_C.ExecuteUbergraph_BP_Skill_PoisonTrap
	// void ExecuteUbergraph_BP_Skill_PoisonTrap(int32_t EntryPoint);                                                           // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Skills/BP_Skill_PoisonInfuse.BP_Skill_PoisonInfuse_C
/// Size: 0x0260 (608 bytes) (0x00024C - 0x000260) align 8 MaxSize: 0x0260
class ABP_Skill_PoisonInfuse_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	class UParticleSystemComponent*                    ParticleSystem;                                             // 0x0258   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_PoisonInfuse.BP_Skill_PoisonInfuse_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PoisonInfuse.BP_Skill_PoisonInfuse_C.EndSkill
	// void EndSkill();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PoisonInfuse.BP_Skill_PoisonInfuse_C.EndSkillFromCharacter
	// void EndSkillFromCharacter();                                                                                            // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_PoisonInfuse.BP_Skill_PoisonInfuse_C.ExecuteUbergraph_BP_Skill_PoisonInfuse
	// void ExecuteUbergraph_BP_Skill_PoisonInfuse(int32_t EntryPoint);                                                         // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Skills/BP_Skill_Invisbility.BP_Skill_Invisbility_C
/// Size: 0x025C (604 bytes) (0x00024C - 0x00025C) align 8 MaxSize: 0x025C
class ABP_Skill_Invisbility_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	int32_t                                            InvisibilityHP;                                             // 0x0258   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_Invisbility.BP_Skill_Invisbility_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Invisbility.BP_Skill_Invisbility_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Invisbility.BP_Skill_Invisbility_C.BreakInvisibility
	// void BreakInvisibility();                                                                                                // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Invisbility.BP_Skill_Invisbility_C.EndSkill
	// void EndSkill();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Invisbility.BP_Skill_Invisbility_C.DamageReceived
	// void DamageReceived(int32_t UnAlteredDamageAmount, class APawn* Attacker);                                               // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Invisbility.BP_Skill_Invisbility_C.ExecuteUbergraph_BP_Skill_Invisbility
	// void ExecuteUbergraph_BP_Skill_Invisbility(int32_t EntryPoint);                                                          // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Skills/BP_Skill_Heal.BP_Skill_Heal_C
/// Size: 0x0298 (664 bytes) (0x00024C - 0x000298) align 8 MaxSize: 0x0298
class ABP_Skill_Heal_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	class UPointLightComponent*                        PointLight;                                                 // 0x0258   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh1;                                                // 0x0260   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0268   (0x0008)  
	float                                              Timeline_0_Opacity_B4C3BFE94F001B93AE929EA7890FC51E;        // 0x0270   (0x0004)  
	float                                              Timeline_0_NewTrack_0_B4C3BFE94F001B93AE929EA7890FC51E;     // 0x0274   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_B4C3BFE94F001B93AE929EA7890FC51E;     // 0x0278   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0279   (0x0007)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x0280   (0x0008)  
	TArray<class AActor*>                              CharactersToHeal;                                           // 0x0288   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_Heal.BP_Skill_Heal_C.Timeline_0__FinishedFunc
	// void Timeline_0__FinishedFunc();                                                                                         // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Skills/BP_Skill_Heal.BP_Skill_Heal_C.Timeline_0__UpdateFunc
	// void Timeline_0__UpdateFunc();                                                                                           // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Skills/BP_Skill_Heal.BP_Skill_Heal_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Heal.BP_Skill_Heal_C.ReceiveActorBeginOverlap
	// void ReceiveActorBeginOverlap(class AActor* OtherActor);                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Heal.BP_Skill_Heal_C.ExecuteUbergraph_BP_Skill_Heal
	// void ExecuteUbergraph_BP_Skill_Heal(int32_t EntryPoint);                                                                 // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Skills/BP_Skill_Grenade.BP_Skill_Grenade_C
/// Size: 0x0260 (608 bytes) (0x00024C - 0x000260) align 8 MaxSize: 0x0260
class ABP_Skill_Grenade_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	class UClass*                                      GrenadeClass;                                               // 0x0258   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_Grenade.BP_Skill_Grenade_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Grenade.BP_Skill_Grenade_C.GrenadesThrown
	// void GrenadesThrown();                                                                                                   // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Grenade.BP_Skill_Grenade_C.ExecuteUbergraph_BP_Skill_Grenade
	// void ExecuteUbergraph_BP_Skill_Grenade(int32_t EntryPoint);                                                              // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Skills/BP_Skill_Grenade_Axis.BP_Skill_Grenade_Axis_C
/// Size: 0x0260 (608 bytes) (0x000260 - 0x000260) align 8 MaxSize: 0x0260
class ABP_Skill_Grenade_Axis_C : public ABP_Skill_Grenade_C
{ 
public:
};

/// Class /Game/Blueprints/Skills/BP_Skill_Dash.BP_Skill_Dash_C
/// Size: 0x0280 (640 bytes) (0x00024C - 0x000280) align 8 MaxSize: 0x0280
class ABP_Skill_Dash_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	bool                                               CanEnd;                                                     // 0x0258   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0259   (0x0007)  MISSED
	class UM_PiercingShotScreenEffect_C*               HUDEffect;                                                  // 0x0260   (0x0008)  
	int32_t                                            BonusDamageAmount;                                          // 0x0268   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x026C   (0x0004)  MISSED
	TArray<class UParticleSystemComponent*>            DashTrail;                                                  // 0x0270   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_Dash.BP_Skill_Dash_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Dash.BP_Skill_Dash_C.ReceiveDestroyed
	// void ReceiveDestroyed();                                                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Dash.BP_Skill_Dash_C.CharacterSet
	// void CharacterSet();                                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_Dash.BP_Skill_Dash_C.ExecuteUbergraph_BP_Skill_Dash
	// void ExecuteUbergraph_BP_Skill_Dash(int32_t EntryPoint);                                                                 // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Skills/BP_Skill_BurningBullets.BP_Skill_BurningBullets_C
/// Size: 0x0260 (608 bytes) (0x00024C - 0x000260) align 8 MaxSize: 0x0260
class ABP_Skill_BurningBullets_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	class UParticleSystemComponent*                    ParticleSystem;                                             // 0x0258   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_BurningBullets.BP_Skill_BurningBullets_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_BurningBullets.BP_Skill_BurningBullets_C.EndSkill
	// void EndSkill();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_BurningBullets.BP_Skill_BurningBullets_C.ExecuteUbergraph_BP_Skill_BurningBullets
	// void ExecuteUbergraph_BP_Skill_BurningBullets(int32_t EntryPoint);                                                       // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C
/// Size: 0x0290 (656 bytes) (0x00024C - 0x000290) align 8 MaxSize: 0x0290
class ABP_Skill_FrenzyFire_C : public ABP_SkillBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x024C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0250   (0x0008)  
	class UPointLightComponent*                        PointLight;                                                 // 0x0258   (0x0008)  
	class UAudioComponent*                             S_FrenzyFire;                                               // 0x0260   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0268   (0x0008)  
	float                                              Fade_Size_D26FDC2045133BE42583C9B382581349;                 // 0x0270   (0x0004)  
	float                                              Fade_Fade_D26FDC2045133BE42583C9B382581349;                 // 0x0274   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Fade__Direction_D26FDC2045133BE42583C9B382581349;           // 0x0278   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0279   (0x0007)  MISSED
	class UTimelineComponent*                          Fade;                                                       // 0x0280   (0x0008)  
	float                                              EffectSpeed;                                                // 0x0288   (0x0004)  
	float                                              FadeTime;                                                   // 0x028C   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C.Fade__FinishedFunc
	// void Fade__FinishedFunc();                                                                                               // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C.Fade__UpdateFunc
	// void Fade__UpdateFunc();                                                                                                 // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C.EndSkill
	// void EndSkill();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C.ReceiveDestroyed
	// void ReceiveDestroyed();                                                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C.SetFrenzyFireEffectOnChar
	// void SetFrenzyFireEffectOnChar(float Value);                                                                             // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C.EnemyDamaged
	// void EnemyDamaged(int32_t DamageAmount);                                                                                 // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Skills/BP_Skill_FrenzyFire.BP_Skill_FrenzyFire_C.ExecuteUbergraph_BP_Skill_FrenzyFire
	// void ExecuteUbergraph_BP_Skill_FrenzyFire(int32_t EntryPoint);                                                           // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C
/// Size: 0x02B8 (696 bytes) (0x000280 - 0x0002B8) align 8 MaxSize: 0x02B8
class ABP_FreeCam_C : public APawn
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	class UCameraComponent*                            Camera;                                                     // 0x0288   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0290   (0x0008)  
	bool                                               Forward;                                                    // 0x0298   (0x0001)  
	bool                                               Backward;                                                   // 0x0299   (0x0001)  
	bool                                               Left;                                                       // 0x029A   (0x0001)  
	bool                                               Right;                                                      // 0x029B   (0x0001)  
	float                                              MovementSpeed;                                              // 0x029C   (0x0004)  
	bool                                               CameraSmooth;                                               // 0x02A0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x02A1   (0x0003)  MISSED
	float                                              AxisValueX;                                                 // 0x02A4   (0x0004)  
	float                                              AxisValueY;                                                 // 0x02A8   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x02AC   (0x0004)  MISSED
	class ABP_Character_C*                             SpectatingPlayer;                                           // 0x02B0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.InpActEvt_W_K2Node_InputKeyEvent
	// void InpActEvt_W_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.InpActEvt_S_K2Node_InputKeyEvent
	// void InpActEvt_S_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.InpActEvt_A_K2Node_InputKeyEvent
	// void InpActEvt_A_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.InpActEvt_D_K2Node_InputKeyEvent
	// void InpActEvt_D_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent
	// void InpActEvt_MouseScrollUp_K2Node_InputKeyEvent(FKey Key);                                                             // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent
	// void InpActEvt_MouseScrollDown_K2Node_InputKeyEvent(FKey Key);                                                           // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.InpActEvt_SpaceBar_K2Node_InputKeyEvent
	// void InpActEvt_SpaceBar_K2Node_InputKeyEvent(FKey Key);                                                                  // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent
	// void InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent(float AxisValue);                                                     // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.InpAxisKeyEvt_MouseY_K2Node_InputAxisKeyEvent
	// void InpAxisKeyEvt_MouseY_K2Node_InputAxisKeyEvent(float AxisValue);                                                     // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Cameras/BP_FreeCam.BP_FreeCam_C.ExecuteUbergraph_BP_FreeCam
	// void ExecuteUbergraph_BP_FreeCam(int32_t EntryPoint);                                                                    // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/SimpleBlueprints/BP_LightActorBase.BP_LightActorBase_C
/// Size: 0x0231 (561 bytes) (0x000220 - 0x000231) align 8 MaxSize: 0x0231
class ABP_LightActorBase_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	bool                                               Enabled;                                                    // 0x0230   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/SimpleBlueprints/BP_LightActorBase.BP_LightActorBase_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x1325ea0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SimpleBlueprints/BP_LightActorBase.BP_LightActorBase_C.Init
	// void Init();                                                                                                             // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SimpleBlueprints/BP_LightActorBase.BP_LightActorBase_C.ExecuteUbergraph_BP_LightActorBase
	// void ExecuteUbergraph_BP_LightActorBase(int32_t EntryPoint);                                                             // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/BP_SniperSpot.BP_SniperSpot_C
/// Size: 0x0231 (561 bytes) (0x000220 - 0x000231) align 8 MaxSize: 0x0231
class ABP_SniperSpot_C : public AActor
{ 
public:
	class UBillboardComponent*                         BillBoard;                                                  // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	TEnumAsByte<E_Teams>                               Team;                                                       // 0x0230   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/AI/BP_SniperSpot.BP_SniperSpot_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x1325ea0] Event|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/Vehicles/BP_VehicleRocket.BP_VehicleRocket_C
/// Size: 0x0230 (560 bytes) (0x000220 - 0x000230) align 8 MaxSize: 0x0230
class ABP_VehicleRocket_C : public AActor
{ 
public:
	class UStaticMeshComponent*                        Allied_Rocket;                                              // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Vehicles/BP_VehicleRocket.BP_VehicleRocket_C.OnRep_Available
	// void OnRep_Available();                                                                                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/AI/BP_AIControllerBase.BP_AIControllerBase_C
/// Size: 0x0360 (864 bytes) (0x000328 - 0x000360) align 8 MaxSize: 0x0360
class ABP_AIControllerBase_C : public ADetourCrowdAIController
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0328   (0x0008)  
	TArray<class ABP_SniperSpot_C*>                    AllSniperSpots;                                             // 0x0330   (0x0010)  
	TArray<class ABP_SniperSpot_C*>                    AlliedSniperSpots;                                          // 0x0340   (0x0010)  
	TArray<class ABP_SniperSpot_C*>                    AxisSniperSpots;                                            // 0x0350   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/AI/BP_AIControllerBase.BP_AIControllerBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/BP_AIControllerBase.BP_AIControllerBase_C.ExecuteUbergraph_BP_AIControllerBase
	// void ExecuteUbergraph_BP_AIControllerBase(int32_t EntryPoint);                                                           // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/AI/BP_AIController_Character.BP_AIController_Character_C
/// Size: 0x0368 (872 bytes) (0x000360 - 0x000368) align 8 MaxSize: 0x0368
class ABP_AIController_Character_C : public ABP_AIControllerBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/AI/BP_AIController_Character.BP_AIController_Character_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/BP_AIController_Character.BP_AIController_Character_C.ReceivePossess
	// void ReceivePossess(class APawn* PossessedPawn);                                                                         // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/BP_AIController_Character.BP_AIController_Character_C.ExecuteUbergraph_BP_AIController_Character
	// void ExecuteUbergraph_BP_AIController_Character(int32_t EntryPoint);                                                     // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/AI/BP_AIController_Tank.BP_AIController_Tank_C
/// Size: 0x0368 (872 bytes) (0x000360 - 0x000368) align 8 MaxSize: 0x0368
class ABP_AIController_Tank_C : public ABP_AIControllerBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/AI/BP_AIController_Tank.BP_AIController_Tank_C.ReceivePossess
	// void ReceivePossess(class APawn* PossessedPawn);                                                                         // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/AI/BP_AIController_Tank.BP_AIController_Tank_C.ExecuteUbergraph_BP_AIController_Tank
	// void ExecuteUbergraph_BP_AIController_Tank(int32_t EntryPoint);                                                          // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/BP_InteractableBase.BP_InteractableBase_C
/// Size: 0x0248 (584 bytes) (0x000220 - 0x000248) align 8 MaxSize: 0x0248
class ABP_InteractableBase_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	FText                                              InteractableName;                                           // 0x0230   (0x0018)  


	/// Functions
	// Function /Game/Blueprints/BP_InteractableBase.BP_InteractableBase_C.Interact(Client)
	// void Interact_Client_(class ABP_Character_C* InteractingCharacter);                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_InteractableBase.BP_InteractableBase_C.Interact(Server)
	// void Interact_Server_();                                                                                                 // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_InteractableBase.BP_InteractableBase_C.ExecuteUbergraph_BP_InteractableBase
	// void ExecuteUbergraph_BP_InteractableBase(int32_t EntryPoint);                                                           // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapPoster.BP_VehicleSwapPoster_C
/// Size: 0x0298 (664 bytes) (0x000248 - 0x000298) align 16 MaxSize: 0x0298
class ABP_VehicleSwapPoster_C : public ABP_InteractableBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0248   (0x0008)  
	class UStaticMeshComponent*                        Plane;                                                      // 0x0250   (0x0008)  
	class UClass*                                      VehicleClassToSwapToo;                                      // 0x0258   (0x0008)  
	FTransform                                         VehicleTransform;                                           // 0x0260   (0x0030)  
	class ABP_VehicleSwapBoard_Base_C*                 BoardRef;                                                   // 0x0290   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapPoster.BP_VehicleSwapPoster_C.CanSwapVehicle?
	// void CanSwapVehicle_(bool& CanSwap);                                                                                     // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapPoster.BP_VehicleSwapPoster_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapPoster.BP_VehicleSwapPoster_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapPoster.BP_VehicleSwapPoster_C.Interact(Server)
	// void Interact_Server_();                                                                                                 // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapPoster.BP_VehicleSwapPoster_C.ExecuteUbergraph_BP_VehicleSwapPoster
	// void ExecuteUbergraph_BP_VehicleSwapPoster(int32_t EntryPoint);                                                          // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Projectiles/BP_SimpleProjectilebase.BP_SimpleProjectilebase_C
/// Size: 0x0360 (864 bytes) (0x000220 - 0x000360) align 8 MaxSize: 0x0360
class ABP_SimpleProjectilebase_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    PoisonSmoke;                                                // 0x0228   (0x0008)  
	class UAudioComponent*                             FlightSound;                                                // 0x0230   (0x0008)  
	class URotatingMovementComponent*                  RotatingMovement;                                           // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0240   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0248   (0x0008)  
	FVector                                            TravelDirection;                                            // 0x0250   (0x000C)  
	FVector                                            LastLocation;                                               // 0x025C   (0x000C)  
	bool                                               Freeze;                                                     // 0x0268   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0269   (0x0007)  MISSED
	TArray<class AActor*>                              Actors_to_Ignore;                                           // 0x0270   (0x0010)  
	FVector                                            InitialLocation;                                            // 0x0280   (0x000C)  
	bool                                               LocalProjectile;                                            // 0x028C   (0x0001)  
	bool                                               IsAIProjectile;                                             // 0x028D   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x028E   (0x0002)  MISSED
	class APawn*                                       AttackerPawn;                                               // 0x0290   (0x0008)  
	float                                              DropAmount;                                                 // 0x0298   (0x0004)  
	float                                              Delta_Seconds;                                              // 0x029C   (0x0004)  
	bool                                               IsPoisonInfused;                                            // 0x02A0   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x02A1   (0x0003)  MISSED
	int32_t                                            BonusDamage;                                                // 0x02A4   (0x0004)  
	class USoundBase*                                  CharacterImpactSound;                                       // 0x02A8   (0x0008)  
	class USoundBase*                                  EnvironmentImpactSound;                                     // 0x02B0   (0x0008)  
	class UParticleSystem*                             ImpactParticle;                                             // 0x02B8   (0x0008)  
	float                                              TravelSpeed;                                                // 0x02C0   (0x0004)  
	float                                              DropSpeed;                                                  // 0x02C4   (0x0004)  
	float                                              LingerTime;                                                 // 0x02C8   (0x0004)  
	bool                                               IgnoreEnemies;                                              // 0x02CC   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x02CD   (0x0003)  MISSED
	FHitResult                                         LastHit;                                                    // 0x02D0   (0x0088)  
	class ABP_EquipableBase_C*                         EquipableRef;                                               // 0x0358   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_SimpleProjectilebase.BP_SimpleProjectilebase_C.FindClosestCharacterBone
	// void FindClosestCharacterBone(FVector ImpactPoint, class ABP_Character_C* Character, FName& ClosestBoneName);            // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_SimpleProjectilebase.BP_SimpleProjectilebase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_SimpleProjectilebase.BP_SimpleProjectilebase_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_SimpleProjectilebase.BP_SimpleProjectilebase_C.SetMeleeWeaponSkin
	// void SetMeleeWeaponSkin(int32_t SkinIndex);                                                                              // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_SimpleProjectilebase.BP_SimpleProjectilebase_C.CharacterHit
	// void CharacterHit(class ABP_Character_C* Character, FVector HitLocation);                                                // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_SimpleProjectilebase.BP_SimpleProjectilebase_C.ExecuteUbergraph_BP_SimpleProjectilebase
	// void ExecuteUbergraph_BP_SimpleProjectilebase(int32_t EntryPoint);                                                       // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Projectiles/BP_SyringeInjector_Old.BP_SyringeInjector_Old_C
/// Size: 0x0374 (884 bytes) (0x000360 - 0x000374) align 8 MaxSize: 0x0374
class ABP_SyringeInjector_Old_C : public ABP_SimpleProjectilebase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  
	class UMaterialBillboardComponent*                 MaterialBillboard;                                          // 0x0368   (0x0008)  
	int32_t                                            RemainingAmmo;                                              // 0x0370   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_SyringeInjector_Old.BP_SyringeInjector_Old_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_SyringeInjector_Old.BP_SyringeInjector_Old_C.CharacterHit
	// void CharacterHit(class ABP_Character_C* Character, FVector HitLocation);                                                // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_SyringeInjector_Old.BP_SyringeInjector_Old_C.ExecuteUbergraph_BP_SyringeInjector_Old
	// void ExecuteUbergraph_BP_SyringeInjector_Old(int32_t EntryPoint);                                                        // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Projectiles/BP_MeleeProjectileBase.BP_MeleeProjectileBase_C
/// Size: 0x0378 (888 bytes) (0x000360 - 0x000378) align 8 MaxSize: 0x0378
class ABP_MeleeProjectileBase_C : public ABP_SimpleProjectilebase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  
	class UParticleSystemComponent*                    TwirlTrail1;                                                // 0x0368   (0x0008)  
	class UParticleSystemComponent*                    TwirlTrail;                                                 // 0x0370   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_MeleeProjectileBase.BP_MeleeProjectileBase_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_MeleeProjectileBase.BP_MeleeProjectileBase_C.CharacterHit
	// void CharacterHit(class ABP_Character_C* Character, FVector HitLocation);                                                // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_MeleeProjectileBase.BP_MeleeProjectileBase_C.ExecuteUbergraph_BP_MeleeProjectileBase
	// void ExecuteUbergraph_BP_MeleeProjectileBase(int32_t EntryPoint);                                                        // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Projectiles/BP_MeleeProjectile_Bayonet.BP_MeleeProjectile_Bayonet_C
/// Size: 0x0378 (888 bytes) (0x000378 - 0x000378) align 8 MaxSize: 0x0378
class ABP_MeleeProjectile_Bayonet_C : public ABP_MeleeProjectileBase_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_MeleeProjectile_Dagger.BP_MeleeProjectile_Dagger_C
/// Size: 0x0378 (888 bytes) (0x000378 - 0x000378) align 8 MaxSize: 0x0378
class ABP_MeleeProjectile_Dagger_C : public ABP_MeleeProjectileBase_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C
/// Size: 0x0330 (816 bytes) (0x000220 - 0x000330) align 16 MaxSize: 0x0330
class ABP_Trapbase_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    TrapIndicator;                                              // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_TrapThrowTrail;                                           // 0x0230   (0x0008)  
	class USphereComponent*                            TrapActivationRadius;                                       // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        TrapMesh;                                                   // 0x0240   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0248   (0x0008)  
	float                                              AutoDetonateCountdown_NewTrack_0_9A9F1F144D30BD7DC15169B6058158A9; // 0x0250   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    AutoDetonateCountdown__Direction_9A9F1F144D30BD7DC15169B6058158A9; // 0x0254   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0255   (0x0003)  MISSED
	class UTimelineComponent*                          AutoDetonateCountdown;                                      // 0x0258   (0x0008)  
	TEnumAsByte<E_Teams>                               Team;                                                       // 0x0260   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0261   (0x0003)  MISSED
	int32_t                                            OwningPlayerIndex;                                          // 0x0264   (0x0004)  
	class APawn*                                       OwningPawn;                                                 // 0x0268   (0x0008)  
	FVector                                            ThrowDirection;                                             // 0x0270   (0x000C)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x027C   (0x0004)  MISSED
	FTransform                                         Transform;                                                  // 0x0280   (0x0030)  
	bool                                               Placed;                                                     // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData03_6[0xF];                                       // 0x02B1   (0x000F)  MISSED
	FTransform                                         FinalTransform;                                             // 0x02C0   (0x0030)  
	TEnumAsByte<E_Teams>                               OwnTeam;                                                    // 0x02F0   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x02F1   (0x0003)  MISSED
	float                                              AOERadius;                                                  // 0x02F4   (0x0004)  
	TEnumAsByte<E_DamageTypes>                         DamageType;                                                 // 0x02F8   (0x0001)  
	unsigned char                                      UnknownData05_6[0x7];                                       // 0x02F9   (0x0007)  MISSED
	class UClass*                                      BuffDebuff;                                                 // 0x0300   (0x0008)  
	int32_t                                            DamageAmount;                                               // 0x0308   (0x0004)  
	float                                              ImpactParticleSize;                                         // 0x030C   (0x0004)  
	class UParticleSystem*                             ExplosionParticle;                                          // 0x0310   (0x0008)  
	bool                                               Armed;                                                      // 0x0318   (0x0001)  
	unsigned char                                      UnknownData06_6[0x3];                                       // 0x0319   (0x0003)  MISSED
	float                                              AutoDetonateTimePassed;                                     // 0x031C   (0x0004)  
	class UMaterialInstanceDynamic*                    GlowMID;                                                    // 0x0320   (0x0008)  
	float                                              LaunchForce;                                                // 0x0328   (0x0004)  
	float                                              ThrowForce;                                                 // 0x032C   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.FindActiveTrapAmountForOwner
	// void FindActiveTrapAmountForOwner(int32_t& TrapAmount, class ABP_Trapbase_C*& OldestTrap);                               // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.OnRep_Armed
	// void OnRep_Armed();                                                                                                      // [0x1325ea0] HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.OnRep_Placed
	// void OnRep_Placed();                                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.AutoDetonateCountdown__FinishedFunc
	// void AutoDetonateCountdown__FinishedFunc();                                                                              // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.AutoDetonateCountdown__UpdateFunc
	// void AutoDetonateCountdown__UpdateFunc();                                                                                // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.ReceiveActorBeginOverlap
	// void ReceiveActorBeginOverlap(class AActor* OtherActor);                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.MC_Explode
	// void MC_Explode();                                                                                                       // [0x1325ea0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.Explode
	// void Explode();                                                                                                          // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.ReceiveHit
	// void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // [0x1325ea0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.MC_Placed
	// void MC_Placed();                                                                                                        // [0x1325ea0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.ApplyDamage
	// void ApplyDamage(int32_t DamageAmount, FVector DamageHitLocation, FVector DamageDirection, class APawn* AttackerPawn, class UClass* Debuff, TEnumAsByte<E_DamageTypes> DamageType, int32_t PlayerIndex, bool IsCriticalHit, bool IgnoreTeamProtection, FText SpecialKillMessage, bool ShouldBreakInvisibility, bool IsPiercingDamage, class UClass* ProjectileClass_optional_, class UClass* EquipableClass_optonal_); // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.SetArmedMaterialState
	// void SetArmedMaterialState();                                                                                            // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.RemoveTrap
	// void RemoveTrap();                                                                                                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Trapbase.BP_Trapbase_C.ExecuteUbergraph_BP_Trapbase
	// void ExecuteUbergraph_BP_Trapbase(int32_t EntryPoint);                                                                   // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Projectiles/BP_PoisonTrap_Axis.BP_PoisonTrap_Axis_C
/// Size: 0x0330 (816 bytes) (0x000330 - 0x000330) align 16 MaxSize: 0x0330
class ABP_PoisonTrap_Axis_C : public ABP_Trapbase_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_PoisonTrap_Allied.BP_PoisonTrap_Allied_C
/// Size: 0x0330 (816 bytes) (0x000330 - 0x000330) align 16 MaxSize: 0x0330
class ABP_PoisonTrap_Allied_C : public ABP_Trapbase_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_ImpactDecal.BP_ImpactDecal_C
/// Size: 0x0248 (584 bytes) (0x000220 - 0x000248) align 8 MaxSize: 0x0248
class ABP_ImpactDecal_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UDecalComponent*                             Decal;                                                      // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	TArray<class UMaterialInstance*>                   DecalMaterials;                                             // 0x0238   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_ImpactDecal.BP_ImpactDecal_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ImpactDecal.BP_ImpactDecal_C.RemoveDecal
	// void RemoveDecal();                                                                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ImpactDecal.BP_ImpactDecal_C.ExecuteUbergraph_BP_ImpactDecal
	// void ExecuteUbergraph_BP_ImpactDecal(int32_t EntryPoint);                                                                // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Projectiles/BP_ImpactDecal_ImpactCrater.BP_ImpactDecal_ImpactCrater_C
/// Size: 0x0248 (584 bytes) (0x000248 - 0x000248) align 8 MaxSize: 0x0248
class ABP_ImpactDecal_ImpactCrater_C : public ABP_ImpactDecal_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_ImpactDecal_BulletHole.BP_ImpactDecal_BulletHole_C
/// Size: 0x0248 (584 bytes) (0x000248 - 0x000248) align 8 MaxSize: 0x0248
class ABP_ImpactDecal_BulletHole_C : public ABP_ImpactDecal_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_ProjectileTrailBase.BP_ProjectileTrailBase_C
/// Size: 0x0275 (629 bytes) (0x000220 - 0x000275) align 8 MaxSize: 0x0275
class ABP_ProjectileTrailBase_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	float                                              Fadeout_NewTrack_0_57B9EC33401D951892946496ED83255F;        // 0x0238   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Fadeout__Direction_57B9EC33401D951892946496ED83255F;        // 0x023C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x023D   (0x0003)  MISSED
	class UTimelineComponent*                          FadeOut;                                                    // 0x0240   (0x0008)  
	class ABP_ProjectileBase_C*                        ProjectileRef;                                              // 0x0248   (0x0008)  
	FVector                                            FinalLocation;                                              // 0x0250   (0x000C)  
	bool                                               FinalLocationReached;                                       // 0x025C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x025D   (0x0003)  MISSED
	FVector                                            LocationToUse;                                              // 0x0260   (0x000C)  
	float                                              FadeSpeed;                                                  // 0x026C   (0x0004)  
	float                                              TrailWidth;                                                 // 0x0270   (0x0004)  
	bool                                               OwnProjectileTrail;                                         // 0x0274   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_ProjectileTrailBase.BP_ProjectileTrailBase_C.Fadeout__FinishedFunc
	// void Fadeout__FinishedFunc();                                                                                            // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Projectiles/BP_ProjectileTrailBase.BP_ProjectileTrailBase_C.Fadeout__UpdateFunc
	// void Fadeout__UpdateFunc();                                                                                              // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Projectiles/BP_ProjectileTrailBase.BP_ProjectileTrailBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileTrailBase.BP_ProjectileTrailBase_C.StopTrail
	// void StopTrail();                                                                                                        // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileTrailBase.BP_ProjectileTrailBase_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileTrailBase.BP_ProjectileTrailBase_C.SetTrail
	// void SetTrail(FVector FinalLocation, FVector InitialLocation);                                                           // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileTrailBase.BP_ProjectileTrailBase_C.ExecuteUbergraph_BP_ProjectileTrailBase
	// void ExecuteUbergraph_BP_ProjectileTrailBase(int32_t EntryPoint);                                                        // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Projectiles/BP_ProjectileTrailBase_BurningBullet.BP_ProjectileTrailBase_BurningBullet_C
/// Size: 0x0275 (629 bytes) (0x000275 - 0x000275) align 8 MaxSize: 0x0275
class ABP_ProjectileTrailBase_BurningBullet_C : public ABP_ProjectileTrailBase_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_ProjectileTrailBase_PowerShot.BP_ProjectileTrailBase_PowerShot_C
/// Size: 0x0275 (629 bytes) (0x000275 - 0x000275) align 8 MaxSize: 0x0275
class ABP_ProjectileTrailBase_PowerShot_C : public ABP_ProjectileTrailBase_C
{ 
public:
};

/// Struct /Game/Blueprints/Structs/ST_ThrowableAttachment.ST_ThrowableAttachment
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FST_ThrowableAttachment
{ 
	class UPrimitiveComponent*                         Component_3_D03C964943C339E274C7399C7409F5AD;               // 0x0000   (0x0008)  
	FVector                                            Location_6_59D6BD0E49F739602581F1B30D513893;                // 0x0008   (0x000C)  
	FRotator                                           Rotation_9_FE6E504541A2B8DBD0ACDF9210367E95;                // 0x0014   (0x000C)  
	FName                                              BoneName_12_E96CC0294A68FBD167121697E5278935;               // 0x0020   (0x0008)  
};

/// Class /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C
/// Size: 0x0570 (1392 bytes) (0x000220 - 0x000570) align 16 MaxSize: 0x0570
class ABP_ProjectileBase_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Tracer2;                                                  // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        projectileMesh;                                             // 0x0230   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0238   (0x0008)  
	FVector                                            FlightDirection;                                            // 0x0240   (0x000C)  
	bool                                               IsThrowable;                                                // 0x024C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x024D   (0x0003)  MISSED
	float                                              Speed;                                                      // 0x0250   (0x0004)  
	float                                              DeltaSeconds;                                               // 0x0254   (0x0004)  
	FVector                                            LastLocation;                                               // 0x0258   (0x000C)  
	int32_t                                            DirectDamageAmount;                                         // 0x0264   (0x0004)  
	TArray<class AActor*>                              ActorsToIgnore;                                             // 0x0268   (0x0010)  
	TEnumAsByte<E_WeaponRange>                         WeaponDamageRange;                                          // 0x0278   (0x0001)  
	bool                                               AOEDamage_;                                                 // 0x0279   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x027A   (0x0002)  MISSED
	float                                              AOERadius;                                                  // 0x027C   (0x0004)  
	int32_t                                            AOEDamageAmount;                                            // 0x0280   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0284   (0x0004)  MISSED
	TArray<class AActor*>                              AlreadyHitActors;                                           // 0x0288   (0x0010)  
	class UClass*                                      BuffDebuffToApply;                                          // 0x0298   (0x0008)  
	float                                              ProjectileLifeSpan;                                         // 0x02A0   (0x0004)  
	float                                              DropRate;                                                   // 0x02A4   (0x0004)  
	class UParticleSystem*                             TracerType;                                                 // 0x02A8   (0x0008)  
	float                                              DropAmount;                                                 // 0x02B0   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x02B4   (0x0004)  MISSED
	class UParticleSystem*                             EnvironmentImpactParticleEffect;                            // 0x02B8   (0x0008)  
	class UParticleSystem*                             CharacterImpactParticleEffect;                              // 0x02C0   (0x0008)  
	class UParticleSystem*                             VehicleImpactParticleEffect;                                // 0x02C8   (0x0008)  
	float                                              ImpactParticleSizeMultiplier;                               // 0x02D0   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x02D4   (0x0004)  MISSED
	class USoundBase*                                  ImpactSound;                                                // 0x02D8   (0x0008)  
	float                                              ImpactProjectileSoundVolume;                                // 0x02E0   (0x0004)  
	float                                              ImpactSoundPitch;                                           // 0x02E4   (0x0004)  
	class UClass*                                      ImpactDecal;                                                // 0x02E8   (0x0008)  
	float                                              ImpactDecalScale;                                           // 0x02F0   (0x0004)  
	TEnumAsByte<E_DamageTypes>                         DirectHitDamageType;                                        // 0x02F4   (0x0001)  
	TEnumAsByte<E_DamageTypes>                         AOEDamageType;                                              // 0x02F5   (0x0001)  
	unsigned char                                      UnknownData05_6[0x2];                                       // 0x02F6   (0x0002)  MISSED
	class APawn*                                       AttackerPawn_DontEdit_;                                     // 0x02F8   (0x0008)  
	bool                                               LocalProjectile_EnableIfServerOrAI_;                        // 0x0300   (0x0001)  
	bool                                               EnableDropRate;                                             // 0x0301   (0x0001)  
	unsigned char                                      UnknownData06_6[0x2];                                       // 0x0302   (0x0002)  MISSED
	FHitResult                                         Hit;                                                        // 0x0304   (0x0088)  
	bool                                               Active;                                                     // 0x038C   (0x0001)  
	unsigned char                                      UnknownData07_6[0x3];                                       // 0x038D   (0x0003)  MISSED
	FTransform                                         ThrowableTransform;                                         // 0x0390   (0x0030)  
	float                                              DetonationDelay;                                            // 0x03C0   (0x0004)  
	unsigned char                                      UnknownData08_6[0x4];                                       // 0x03C4   (0x0004)  MISSED
	class USoundBase*                                  ThrowableBounceSound;                                       // 0x03C8   (0x0008)  
	FVector                                            LastThrowableLocation;                                      // 0x03D0   (0x000C)  
	bool                                               EnableFlyBySound;                                           // 0x03DC   (0x0001)  
	bool                                               CanCriticalHit;                                             // 0x03DD   (0x0001)  
	unsigned char                                      UnknownData09_6[0x2];                                       // 0x03DE   (0x0002)  MISSED
	FVector                                            InitialLocation;                                            // 0x03E0   (0x000C)  
	float                                              ProjectileCollisionImmuneDistance;                          // 0x03EC   (0x0004)  
	float                                              HitDetectionOffset;                                         // 0x03F0   (0x0004)  
	bool                                               UseCloseByCollisionImunity;                                 // 0x03F4   (0x0001)  
	bool                                               VehicleHit;                                                 // 0x03F5   (0x0001)  
	bool                                               CharacterHit;                                               // 0x03F6   (0x0001)  
	bool                                               DirectHit;                                                  // 0x03F7   (0x0001)  
	SDK_UNDEFINED(16,614) /* FMulticastInlineDelegate */ __um(OnDirectHit);                                        // 0x03F8   (0x0010)  
	bool                                               IsAIProjectile;                                             // 0x0408   (0x0001)  
	unsigned char                                      UnknownData10_6[0x7];                                       // 0x0409   (0x0007)  MISSED
	FText                                              SpecialKillMessage;                                         // 0x0410   (0x0018)  
	bool                                               EnableHeadshots;                                            // 0x0428   (0x0001)  
	unsigned char                                      UnknownData11_6[0x7];                                       // 0x0429   (0x0007)  MISSED
	class UCurveFloat*                                 WeaponRangeCurve;                                           // 0x0430   (0x0008)  
	FVector                                            CharacterOrigin;                                            // 0x0438   (0x000C)  
	float                                              LaunchForce;                                                // 0x0444   (0x0004)  
	bool                                               CreateTrail;                                                // 0x0448   (0x0001)  
	unsigned char                                      UnknownData12_6[0x3];                                       // 0x0449   (0x0003)  MISSED
	float                                              TrailWidth;                                                 // 0x044C   (0x0004)  
	TEnumAsByte<E_TrailLengths>                        TrailLengthType;                                            // 0x0450   (0x0001)  
	unsigned char                                      UnknownData13_6[0x3];                                       // 0x0451   (0x0003)  MISSED
	float                                              ProjectileRadius;                                           // 0x0454   (0x0004)  
	bool                                               IsHeadShot;                                                 // 0x0458   (0x0001)  
	unsigned char                                      UnknownData14_6[0x7];                                       // 0x0459   (0x0007)  MISSED
	class ABP_ProjectileTrailBase_C*                   TrailRef;                                                   // 0x0460   (0x0008)  
	bool                                               StickyThrowable;                                            // 0x0468   (0x0001)  
	bool                                               IsStuckToObject_StickyThrowable_;                           // 0x0469   (0x0001)  
	unsigned char                                      UnknownData15_6[0x2];                                       // 0x046A   (0x0002)  MISSED
	FHitResult                                         LastStickyThrowableObjectHit;                               // 0x046C   (0x0088)  
	unsigned char                                      UnknownData16_6[0x4];                                       // 0x04F4   (0x0004)  MISSED
	FST_ThrowableAttachment                            ThrowableAttachment;                                        // 0x04F8   (0x0028)  
	bool                                               AttachImpactParticleToCharacter;                            // 0x0520   (0x0001)  
	bool                                               IsPiercingDamage;                                           // 0x0521   (0x0001)  
	unsigned char                                      UnknownData17_6[0x2];                                       // 0x0522   (0x0002)  MISSED
	FVector                                            WeaponProjectileExitLocation;                               // 0x0524   (0x000C)  
	bool                                               EnableCloseByDamageReduction;                               // 0x0530   (0x0001)  
	bool                                               IgnoreAOERadius_AlwaysDealFullDMG_;                         // 0x0531   (0x0001)  
	bool                                               EnableDebug;                                                // 0x0532   (0x0001)  
	unsigned char                                      UnknownData18_6[0x1];                                       // 0x0533   (0x0001)  MISSED
	int32_t                                            BonusDamage;                                                // 0x0534   (0x0004)  
	bool                                               ExplodeOnLifeEnd;                                           // 0x0538   (0x0001)  
	unsigned char                                      UnknownData19_6[0x3];                                       // 0x0539   (0x0003)  MISSED
	float                                              MaxProjectileTravelDistance;                                // 0x053C   (0x0004)  
	FVector                                            AOELocation;                                                // 0x0540   (0x000C)  
	int32_t                                            UniqueProjectileID;                                         // 0x054C   (0x0004)  
	bool                                               ServerProjectile;                                           // 0x0550   (0x0001)  
	unsigned char                                      UnknownData20_6[0x3];                                       // 0x0551   (0x0003)  MISSED
	FVector                                            AddedVelocity;                                              // 0x0554   (0x000C)  
	class UClass*                                      TrailToUse;                                                 // 0x0560   (0x0008)  
	class UClass*                                      EquipableClass_optional_;                                   // 0x0568   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.GetDistanceTraveled
	// float GetDistanceTraveled();                                                                                             // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.OnRep_ThrowableAttachment
	// void OnRep_ThrowableAttachment();                                                                                        // [0x1325ea0] HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.CalculateDamageFalloff
	// void CalculateDamageFalloff(int32_t DamageIn, int32_t& ResultingDamage);                                                 // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.OnRep_IsThrowable
	// void OnRep_IsThrowable();                                                                                                // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.ReceiveHit
	// void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // [0x1325ea0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.MC_Bounce
	// void MC_Bounce();                                                                                                        // [0x1325ea0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.MC_ThrowableExplode
	// void MC_ThrowableExplode(FVector Location);                                                                              // [0x1325ea0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.KillThrowable
	// void KillThrowable();                                                                                                    // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.WasDirectHit
	// void WasDirectHit();                                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.InstantHit
	// void InstantHit(FHitResult HitResult);                                                                                   // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.Detonate
	// void Detonate();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.TriggerAOE
	// void TriggerAOE(FVector AOELocation);                                                                                    // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.ConfirmDirectHit
	// void ConfirmDirectHit(class AActor*& HitActor, FVector HitLocation, bool HS);                                            // [0x1325ea0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.EndProjectile
	// void EndProjectile();                                                                                                    // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.ConfirmAOEHits
	// void ConfirmAOEHits(FVector AOELocation, TArray<AActor*>& HitActors, TArray<FVector>& HitLocations, TArray<ABP_Character_C*>& CharactersToLaunch, TArray<FVector>& LaunchVelocities); // [0x1325ea0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.MarkProjectileForDestroy
	// void MarkProjectileForDestroy();                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.ExecuteUbergraph_BP_ProjectileBase
	// void ExecuteUbergraph_BP_ProjectileBase(int32_t EntryPoint);                                                             // [0x1325ea0] Final|HasDefaults    
	// Function /Game/Blueprints/Projectiles/BP_ProjectileBase.BP_ProjectileBase_C.OnDirectHit__DelegateSignature
	// void OnDirectHit__DelegateSignature(class AActor* KilledActor);                                                          // [0x1325ea0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/Projectiles/BP_Bomb.BP_Bomb_C
/// Size: 0x0578 (1400 bytes) (0x000570 - 0x000578) align 16 MaxSize: 0x0578
class ABP_Bomb_C : public ABP_ProjectileBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0570   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_Bomb.BP_Bomb_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Bomb.BP_Bomb_C.ReceiveDestroyed
	// void ReceiveDestroyed();                                                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_Bomb.BP_Bomb_C.ExecuteUbergraph_BP_Bomb
	// void ExecuteUbergraph_BP_Bomb(int32_t EntryPoint);                                                                       // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Projectiles/BP_LauncherRocketProjectile.BP_LauncherRocketProjectile_C
/// Size: 0x0590 (1424 bytes) (0x000570 - 0x000590) align 16 MaxSize: 0x0590
class ABP_LauncherRocketProjectile_C : public ABP_ProjectileBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0570   (0x0008)  
	class UParticleSystemComponent*                    TrailEmitter;                                               // 0x0578   (0x0008)  
	float                                              RocketTrailSize;                                            // 0x0580   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0584   (0x0004)  MISSED
	class UParticleSystem*                             RocketTrailParticle;                                        // 0x0588   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_LauncherRocketProjectile.BP_LauncherRocketProjectile_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_LauncherRocketProjectile.BP_LauncherRocketProjectile_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_LauncherRocketProjectile.BP_LauncherRocketProjectile_C.ReceiveDestroyed
	// void ReceiveDestroyed();                                                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_LauncherRocketProjectile.BP_LauncherRocketProjectile_C.WasDirectHit
	// void WasDirectHit();                                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_LauncherRocketProjectile.BP_LauncherRocketProjectile_C.EndProjectile
	// void EndProjectile();                                                                                                    // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_LauncherRocketProjectile.BP_LauncherRocketProjectile_C.ExecuteUbergraph_BP_LauncherRocketProjectile
	// void ExecuteUbergraph_BP_LauncherRocketProjectile(int32_t EntryPoint);                                                   // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Projectiles/BP_VehicleRocketProjectile.BP_VehicleRocketProjectile_C
/// Size: 0x05A8 (1448 bytes) (0x000590 - 0x0005A8) align 16 MaxSize: 0x05A8
class ABP_VehicleRocketProjectile_C : public ABP_LauncherRocketProjectile_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0590   (0x0008)  
	class UAudioComponent*                             S_RocketFlight;                                             // 0x0598   (0x0008)  
	class UParticleSystemComponent*                    TrailEmitter;                                               // 0x05A0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_VehicleRocketProjectile.BP_VehicleRocketProjectile_C.EndProjectile
	// void EndProjectile();                                                                                                    // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_VehicleRocketProjectile.BP_VehicleRocketProjectile_C.ExecuteUbergraph_BP_VehicleRocketProjectile
	// void ExecuteUbergraph_BP_VehicleRocketProjectile(int32_t EntryPoint);                                                    // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Projectiles/BP_ThrowableProjectileBase.BP_ThrowableProjectileBase_C
/// Size: 0x0581 (1409 bytes) (0x000570 - 0x000581) align 16 MaxSize: 0x0581
class ABP_ThrowableProjectileBase_C : public ABP_ProjectileBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0570   (0x0008)  
	class UParticleSystemComponent*                    P_ThrowableIndicatorEffect;                                 // 0x0578   (0x0008)  
	TEnumAsByte<E_Teams>                               ThrowableTeam;                                              // 0x0580   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_ThrowableProjectileBase.BP_ThrowableProjectileBase_C.OnRep_ThrowableTeam
	// void OnRep_ThrowableTeam();                                                                                              // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ThrowableProjectileBase.BP_ThrowableProjectileBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ThrowableProjectileBase.BP_ThrowableProjectileBase_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_ThrowableProjectileBase.BP_ThrowableProjectileBase_C.ExecuteUbergraph_BP_ThrowableProjectileBase
	// void ExecuteUbergraph_BP_ThrowableProjectileBase(int32_t EntryPoint);                                                    // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Projectiles/BP_PowderKegProjectile.BP_PowderKegProjectile_C
/// Size: 0x05B4 (1460 bytes) (0x000581 - 0x0005B4) align 16 MaxSize: 0x05B4
class ABP_PowderKegProjectile_C : public ABP_ThrowableProjectileBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0581   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0588   (0x0008)  
	class UAudioComponent*                             Audio;                                                      // 0x0590   (0x0008)  
	class UParticleSystemComponent*                    Fuse;                                                       // 0x0598   (0x0008)  
	float                                              Timeline_0_NewTrack_0_50E651BD46AC8F86F4BA86BBF0CFD8BC;     // 0x05A0   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_50E651BD46AC8F86F4BA86BBF0CFD8BC;     // 0x05A4   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x05A5   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x05A8   (0x0008)  
	int32_t                                            KegHP;                                                      // 0x05B0   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_PowderKegProjectile.BP_PowderKegProjectile_C.Timeline_0__FinishedFunc
	// void Timeline_0__FinishedFunc();                                                                                         // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Projectiles/BP_PowderKegProjectile.BP_PowderKegProjectile_C.Timeline_0__UpdateFunc
	// void Timeline_0__UpdateFunc();                                                                                           // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Projectiles/BP_PowderKegProjectile.BP_PowderKegProjectile_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_PowderKegProjectile.BP_PowderKegProjectile_C.ApplyDamage
	// void ApplyDamage(int32_t DamageAmount, FVector DamageHitLocation, FVector DamageDirection, class APawn* AttackerPawn, class UClass* Debuff, TEnumAsByte<E_DamageTypes> DamageType, int32_t PlayerIndex, bool IsCriticalHit, bool IgnoreTeamProtection, FText SpecialKillMessage, bool ShouldBreakInvisibility, bool IsPiercingDamage, class UClass* ProjectileClass_optional_, class UClass* EquipableClass_optonal_); // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_PowderKegProjectile.BP_PowderKegProjectile_C.MC_HitEffect
	// void MC_HitEffect(FVector Location);                                                                                     // [0x1325ea0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_PowderKegProjectile.BP_PowderKegProjectile_C.ReceiveDestroyed
	// void ReceiveDestroyed();                                                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_PowderKegProjectile.BP_PowderKegProjectile_C.ExecuteUbergraph_BP_PowderKegProjectile
	// void ExecuteUbergraph_BP_PowderKegProjectile(int32_t EntryPoint);                                                        // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Projectiles/BP_SmallGrenadeAllied.BP_SmallGrenadeAllied_C
/// Size: 0x0581 (1409 bytes) (0x000581 - 0x000581) align 16 MaxSize: 0x0581
class ABP_SmallGrenadeAllied_C : public ABP_ThrowableProjectileBase_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_SmallGrenadeAxis.BP_SmallGrenadeAxis_C
/// Size: 0x0581 (1409 bytes) (0x000581 - 0x000581) align 16 MaxSize: 0x0581
class ABP_SmallGrenadeAxis_C : public ABP_SmallGrenadeAllied_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_TNTBomb.BP_TNTBomb_C
/// Size: 0x0598 (1432 bytes) (0x000581 - 0x000598) align 16 MaxSize: 0x0598
class ABP_TNTBomb_C : public ABP_ThrowableProjectileBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0581   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0588   (0x0008)  
	class UAudioComponent*                             ClockTicking;                                               // 0x0590   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_TNTBomb.BP_TNTBomb_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_TNTBomb.BP_TNTBomb_C.ExecuteUbergraph_BP_TNTBomb
	// void ExecuteUbergraph_BP_TNTBomb(int32_t EntryPoint);                                                                    // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapBoard_Base.BP_VehicleSwapBoard_Base_C
/// Size: 0x0269 (617 bytes) (0x000220 - 0x000269) align 8 MaxSize: 0x0269
class ABP_VehicleSwapBoard_Base_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UStaticMeshComponent*                        BillBoard;                                                  // 0x0228   (0x0008)  
	class UChildActorComponent*                        Vehicle2;                                                   // 0x0230   (0x0008)  
	class UChildActorComponent*                        Vehicle1;                                                   // 0x0238   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0240   (0x0008)  
	class ABP_VehicleBase_C*                           VehicleRef_Current_;                                        // 0x0248   (0x0008)  
	TArray<class ABP_VehicleSeat_C*>                   VehicleSeats;                                               // 0x0250   (0x0010)  
	class ABP_VehicleBase_C*                           LastVehicleRef;                                             // 0x0260   (0x0008)  
	bool                                               CanSwap;                                                    // 0x0268   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapBoard_Base.BP_VehicleSwapBoard_Base_C.CanSwapVehicles
	// void CanSwapVehicles(bool& CanSwap);                                                                                     // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapBoard_Base.BP_VehicleSwapBoard_Base_C.OnRep_VehicleInUse
	// void OnRep_VehicleInUse();                                                                                               // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapBoard_Base.BP_VehicleSwapBoard_Base_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapBoard_Base.BP_VehicleSwapBoard_Base_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapBoard_Base.BP_VehicleSwapBoard_Base_C.FetchVehicleSeats
	// void FetchVehicleSeats();                                                                                                // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_VehicleSwapBoard_Base.BP_VehicleSwapBoard_Base_C.ExecuteUbergraph_BP_VehicleSwapBoard_Base
	// void ExecuteUbergraph_BP_VehicleSwapBoard_Base(int32_t EntryPoint);                                                      // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_P51Poster.BP_P51Poster_C
/// Size: 0x0298 (664 bytes) (0x000298 - 0x000298) align 16 MaxSize: 0x0298
class ABP_P51Poster_C : public ABP_VehicleSwapPoster_C
{ 
public:
};

/// Class /Game/Blueprints/Vehicles/VehicleSwapBoard/BP_BeaufighterPoster.BP_BeaufighterPoster_C
/// Size: 0x0298 (664 bytes) (0x000298 - 0x000298) align 16 MaxSize: 0x0298
class ABP_BeaufighterPoster_C : public ABP_VehicleSwapPoster_C
{ 
public:
};

/// Class /Game/Blueprints/Projectiles/BP_DecalManager.BP_DecalManager_C
/// Size: 0x0240 (576 bytes) (0x000220 - 0x000240) align 8 MaxSize: 0x0240
class ABP_DecalManager_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	TArray<class ABP_ImpactDecal_C*>                   Decals;                                                     // 0x0230   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/Projectiles/BP_DecalManager.BP_DecalManager_C.CreateDecal
	// void CreateDecal(class UClass* Class, FTransform Transform);                                                             // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Projectiles/BP_DecalManager.BP_DecalManager_C.ExecuteUbergraph_BP_DecalManager
	// void ExecuteUbergraph_BP_DecalManager(int32_t EntryPoint);                                                               // [0x1325ea0] Final|HasDefaults    
};

/// Struct /Game/Blueprints/Projectiles/ST_ProjectileHitRequest.ST_ProjectileHitRequest
/// Size: 0x0019 (25 bytes) (0x000000 - 0x000019) align 8 MaxSize: 0x0019
struct FST_ProjectileHitRequest
{ 
	class AActor*                                      HitActor_8_1457B6A24E2C103DD32393BFE4E3948F;                // 0x0000   (0x0008)  
	int32_t                                            ProjectileID_2_007E9F444026C71522E368B7976C0F81;            // 0x0008   (0x0004)  
	FVector                                            Location_5_099B3CB34D35CA38949BB2B140F1B1AD;                // 0x000C   (0x000C)  
	bool                                               HS_10_3994AADE4D453145E52ED0B1C791C666;                     // 0x0018   (0x0001)  
};

/// Struct /Game/Blueprints/Projectiles/ST_AOEHitRequest.ST_AOEHitRequest
/// Size: 0x0054 (84 bytes) (0x000000 - 0x000054) align 8 MaxSize: 0x0054
struct FST_AOEHitRequest
{ 
	TArray<class AActor*>                              HitActor_11_1457B6A24E2C103DD32393BFE4E3948F;               // 0x0000   (0x0010)  
	TArray<FVector>                                    Location_12_099B3CB34D35CA38949BB2B140F1B1AD;               // 0x0010   (0x0010)  
	int32_t                                            ProjectileID_2_007E9F444026C71522E368B7976C0F81;            // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	TArray<class ABP_Character_C*>                     CharactersToLaunch_17_FDE948CE47B519044A12B7805BC89973;     // 0x0028   (0x0010)  
	TArray<FVector>                                    LaunchVelocities_20_6F092A774D72184B2768058D50F4F536;       // 0x0038   (0x0010)  
	FVector                                            AOELocation_23_162AF2D741B4F38CF355F081F6821FC2;            // 0x0048   (0x000C)  
};

/// Class /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C
/// Size: 0x03D1 (977 bytes) (0x000320 - 0x0003D1) align 8 MaxSize: 0x03D1
class ABP_PlayerState_C : public APlayerState
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0320   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0328   (0x0008)  
	TEnumAsByte<E_Teams>                               Team;                                                       // 0x0330   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0331   (0x0007)  MISSED
	SDK_UNDEFINED(16,615) /* FMulticastInlineDelegate */ __um(OnEnemyKilled);                                      // 0x0338   (0x0010)  
	int32_t                                            PlayerIndex;                                                // 0x0348   (0x0004)  
	int32_t                                            KillCounter_MultikillAnnouncement_;                         // 0x034C   (0x0004)  
	bool                                               IsHost;                                                     // 0x0350   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0351   (0x0003)  MISSED
	float                                              MultiKillTimer;                                             // 0x0354   (0x0004)  
	FText                                              RecentlyKilledPlayer;                                       // 0x0358   (0x0018)  
	FString                                            CachedUsername;                                             // 0x0370   (0x0010)  
	int32_t                                            FiredProjectileCounter;                                     // 0x0380   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0384   (0x0004)  MISSED
	TArray<class ABP_ProjectileBase_C*>                ServerStoredProjectiles;                                    // 0x0388   (0x0010)  
	TArray<FST_ProjectileHitRequest>                   RequestedHitQueue;                                          // 0x0398   (0x0010)  
	TArray<FST_AOEHitRequest>                          RequestedAOEHitQueue;                                       // 0x03A8   (0x0010)  
	bool                                               Supporter;                                                  // 0x03B8   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x03B9   (0x0007)  MISSED
	SDK_UNDEFINED(16,616) /* FMulticastInlineDelegate */ __um(FinishedStatUpload);                                 // 0x03C0   (0x0010)  
	bool                                               StatsSaved;                                                 // 0x03D0   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.UnregisterProjectile
	// void UnregisterProjectile(class ABP_ProjectileBase_C*& Projectile);                                                      // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ProjectileAOEHit
	// void ProjectileAOEHit(FST_AOEHitRequest HitRequest, bool& Success, int32_t& UsedID);                                     // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ProjectileDirectHit
	// void ProjectileDirectHit(class AActor* HitActor, FVector HitLocation, int32_t ProjectileID, bool HS, bool& Success, int32_t& UsedID); // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.RegisterProjectile
	// void RegisterProjectile(class ABP_ProjectileBase_C* Projectile);                                                         // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.GetNewProjectileID
	// void GetNewProjectileID(int32_t& ProjectileID);                                                                          // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.GetSteamID
	// void GetSteamID(FString& SteamID);                                                                                       // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ValidateUsername
	// void ValidateUsername(FString UserName, bool& IsValid);                                                                  // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.CacheUsername
	// void CacheUsername(FString UserName);                                                                                    // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.IncreaseKills
	// void IncreaseKills(int32_t Amount);                                                                                      // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OnCallback_BA1154734500EA7486022981FDC0BF25
	// void OnCallback_BA1154734500EA7486022981FDC0BF25(FLeaderboardFindResult& Data, bool bWasSuccessful);                     // [0x1325ea0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OnCallback_BD93632144A9FF8EE2204AB5F95EABCF
	// void OnCallback_BD93632144A9FF8EE2204AB5F95EABCF(FLeaderboardScoresDownloadedForUsers& Data, bool bWasSuccessful);       // [0x1325ea0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OnCallback_40B05A2948E2A008DAEADC92E4EF73B4
	// void OnCallback_40B05A2948E2A008DAEADC92E4EF73B4(FLeaderboardScoreUploaded& Data, bool bWasSuccessful);                  // [0x1325ea0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OC_DisplayDamageNumbers
	// void OC_DisplayDamageNumbers(FVector HitLocation, int32_t DamageAmount, bool CriticalHit_, class AActor* HitActor, bool IsLow, TEnumAsByte<E_DamageTypes> DamageType, class UClass* EquipableClass_optional_); // [0x1325ea0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OC_Kill
	// void OC_Kill(FText KilledEnemyName, bool IsAssist, bool CountAsKill);                                                    // [0x1325ea0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OC_PostSpecialActionNotification
	// void OC_PostSpecialActionNotification(FText Message, FLinearColor Color);                                                // [0x1325ea0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OC_SaveStatsToSteam
	// void OC_SaveStatsToSteam(FST_PlayerStats Stats);                                                                         // [0x1325ea0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OC_ExitToMainMenu
	// void OC_ExitToMainMenu(FString DisconnectErrorCode, bool FastBoot);                                                      // [0x1325ea0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ResetKillCounter
	// void ResetKillCounter();                                                                                                 // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.S_ProjectileHit
	// void S_ProjectileHit(class AActor* HitActor, FVector HitLocation, int32_t ProjectileID, bool HS);                        // [0x1325ea0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.S_AOEHit
	// void S_AOEHit(TArray<AActor*>& HitActors, TArray<FVector>& HitLocations, int32_t ProjectileID, TArray<ABP_Character_C*>& CharactersToLaunch, TArray<FVector>& LaunchVelocities, FVector AOELocation); // [0x1325ea0] Net|NetReliableNetServer|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.IncrementLB
	// void IncrementLB(int32_t Amount, FString LBName);                                                                        // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ParseNextLB
	// void ParseNextLB();                                                                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ExitGame
	// void ExitGame();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OC_VehicleKill
	// void OC_VehicleKill(class UClass* ProjectileClass);                                                                      // [0x1325ea0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ItemDropTrigger
	// void ItemDropTrigger();                                                                                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.ExecuteUbergraph_BP_PlayerState
	// void ExecuteUbergraph_BP_PlayerState(int32_t EntryPoint);                                                                // [0x1325ea0] Final|HasDefaults    
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.FinishedStatUpload__DelegateSignature
	// void FinishedStatUpload__DelegateSignature();                                                                            // [0x1325ea0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Playerstates/BP_PlayerState.BP_PlayerState_C.OnEnemyKilled__DelegateSignature
	// void OnEnemyKilled__DelegateSignature(FText KilledEnemyName, bool IsAssistKill, bool CountAsKill);                       // [0x1325ea0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/LightingScenarios/BP_NewSky.BP_NewSky_C
/// Size: 0x02B4 (692 bytes) (0x000220 - 0x0002B4) align 8 MaxSize: 0x02B4
class ABP_NewSky_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UDirectionalLightComponent*                  DirectionalLight;                                           // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        SkySphereMesh;                                              // 0x0230   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0238   (0x0008)  
	bool                                               Refresh;                                                    // 0x0240   (0x0001)  
	bool                                               EnableCustomFog;                                            // 0x0241   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0242   (0x0002)  MISSED
	FLinearColor                                       CustomFogColor;                                             // 0x0244   (0x0010)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0254   (0x0004)  MISSED
	class UMaterialInterface*                          SkyTexture;                                                 // 0x0258   (0x0008)  
	float                                              SkyboxHeight;                                               // 0x0260   (0x0004)  
	bool                                               UseSunHaze;                                                 // 0x0264   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0265   (0x0003)  MISSED
	FLinearColor                                       SunHazeColor;                                               // 0x0268   (0x0010)  
	float                                              TODEmissiveness;                                            // 0x0278   (0x0004)  
	bool                                               IsNight;                                                    // 0x027C   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x027D   (0x0003)  MISSED
	FLinearColor                                       LightColor;                                                 // 0x0280   (0x0010)  
	FRotator                                           LightDirection;                                             // 0x0290   (0x000C)  
	float                                              Temperature;                                                // 0x029C   (0x0004)  
	float                                              Intensity;                                                  // 0x02A0   (0x0004)  
	FLinearColor                                       ColorOverlay;                                               // 0x02A4   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/LightingScenarios/BP_NewSky.BP_NewSky_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x1325ea0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/LightingScenarios/BP_NewSky.BP_NewSky_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/LightingScenarios/BP_NewSky.BP_NewSky_C.RefreshSkyParameters
	// void RefreshSkyParameters();                                                                                             // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/LightingScenarios/BP_NewSky.BP_NewSky_C.LoadShadowBasedLightSettings
	// void LoadShadowBasedLightSettings();                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/LightingScenarios/BP_NewSky.BP_NewSky_C.ExecuteUbergraph_BP_NewSky
	// void ExecuteUbergraph_BP_NewSky(int32_t EntryPoint);                                                                     // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Functions/ExtraSteamCoreProFunctions.ExtraSteamCoreProFunctions_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UExtraSteamCoreProFunctions_C : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Game/Blueprints/Functions/ExtraSteamCoreProFunctions.ExtraSteamCoreProFunctions_C.GetExtraSettingsStringFromCurrentSession
	// void GetExtraSettingsStringFromCurrentSession(FString Key, class UObject* __WorldContext, FString& String);              // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Functions/ExtraSteamCoreProFunctions.ExtraSteamCoreProFunctions_C.GetExtraSettingsIntFromCurrentSession
	// void GetExtraSettingsIntFromCurrentSession(FString Key, class UObject* __WorldContext, int32_t& Bool);                   // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Functions/ExtraSteamCoreProFunctions.ExtraSteamCoreProFunctions_C.GetExtraSettingString
	// void GetExtraSettingString(FString Key, FSteamSessionResult& Session, class UObject* __WorldContext, FString& String);   // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Functions/ExtraSteamCoreProFunctions.ExtraSteamCoreProFunctions_C.GetExtraSettingsInt
	// void GetExtraSettingsInt(FString Key, FSteamSessionResult Session, class UObject* __WorldContext, int32_t& Bool);        // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
};

/// Class /Game/Blueprints/Cameras/BP_MapCam.BP_MapCam_C
/// Size: 0x0298 (664 bytes) (0x000280 - 0x000298) align 8 MaxSize: 0x0298
class ABP_MapCam_C : public APawn
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	class UCameraComponent*                            Camera;                                                     // 0x0288   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0290   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Cameras/BP_MapCam.BP_MapCam_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Cameras/BP_MapCam.BP_MapCam_C.ExecuteUbergraph_BP_MapCam
	// void ExecuteUbergraph_BP_MapCam(int32_t EntryPoint);                                                                     // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/BP_MapCenter.BP_MapCenter_C
/// Size: 0x0230 (560 bytes) (0x000220 - 0x000230) align 8 MaxSize: 0x0230
class ABP_MapCenter_C : public AActor
{ 
public:
	class UBillboardComponent*                         BillBoard;                                                  // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
};

/// Class /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UWidgetFunctions_C : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.SelectClosestSpawnPointToCenter
	// void SelectClosestSpawnPointToCenter(TEnumAsByte<E_Teams> Team, class UObject* __WorldContext, class UW_SpawnSelectPoint_C*& ClosestPoint); // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.BlackFadeInAndOut
	// void BlackFadeInAndOut(class UObject* __WorldContext);                                                                   // [0x1325ea0] Static|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.RemoveLoadingScreen
	// void RemoveLoadingScreen(class UObject* __WorldContext);                                                                 // [0x1325ea0] Static|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.ShowLoadingScreen
	// void ShowLoadingScreen(FText MapName, FText ServerName, class UObject* __WorldContext);                                  // [0x1325ea0] Static|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.GetTeamJoinableStates
	// void GetTeamJoinableStates(class UObject* __WorldContext, bool& CanJoinAllies, bool& CanJoinAxis, int32_t& AlliedPlayers, int32_t& AxisPlayers); // [0x1325ea0] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.GetTeamPlayerAmount
	// void GetTeamPlayerAmount(class UObject* __WorldContext, int32_t& AlliedPlayers, int32_t& AxisPlayers);                   // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.GetActivePlayerCount
	// void GetActivePlayerCount(class UObject* __WorldContext, int32_t& PlayerCount);                                          // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.SetWeaponInLoadout
	// void SetWeaponInLoadout(TEnumAsByte<E_Selectables> Selection, int32_t SelectedItemIndex, class UObject* __WorldContext); // [0x1325ea0] Static|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.GetFinalClassName
	// void GetFinalClassName(TEnumAsByte<E_Units> Class, class UObject* __WorldContext, FText& Name);                          // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.GetCrosshairTypeIndex
	// void GetCrosshairTypeIndex(TEnumAsByte<E_CrosshairTypes> Selection, class UObject* __WorldContext, int32_t& Index);      // [0x1325ea0] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.FormatKeybindName
	// FText FormatKeybindName(FText KeybindName, class UObject* __WorldContext);                                               // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.GetCurrencyIcon(Events)
	// void GetCurrencyIcon_Events_(TEnumAsByte<E_CurrencyTypes> Currency, class UObject* __WorldContext, class UTexture2D*& LargeIcon, class UTexture2D*& SmallIcon); // [0x1325ea0] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.GetSelectableStatsAsText
	// void GetSelectableStatsAsText(FST_Selectable Selectable, class UObject* __WorldContext, FText& Stats);                   // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.PostSpecialActionNotification
	// void PostSpecialActionNotification(FText Message, FLinearColor Color, FName Tag, FText KilledPlayerUsername, class UObject* __WorldContext); // [0x1325ea0] Static|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.PostGamestateNotification
	// void PostGamestateNotification(FText NotificationMessage, class UTexture2D* NotificationIcon, FLinearColor Color, class UObject* __WorldContext); // [0x1325ea0] Static|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Functions/WidgetFunctions.WidgetFunctions_C.GetCrosshairStyle
	// void GetCrosshairStyle(class UObject* __WorldContext, FSlateBrush& CrosshairNormal, FSlateBrush& CrosshairHit);          // [0x1325ea0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
};

/// Class /Game/Blueprints/Vehicles/ActorRefCountDown.ActorRefCountDown_C
/// Size: 0x00D4 (212 bytes) (0x0000B0 - 0x0000D4) align 8 MaxSize: 0x00D4
class UActorRefCountDown_C : public UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00B0   (0x0008)  
	class AActor*                                      Actor;                                                      // 0x00B8   (0x0008)  
	SDK_UNDEFINED(16,617) /* FMulticastInlineDelegate */ __um(CountDownEnded);                                     // 0x00C0   (0x0010)  
	float                                              CountDownTime;                                              // 0x00D0   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Vehicles/ActorRefCountDown.ActorRefCountDown_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/ActorRefCountDown.ActorRefCountDown_C.CountDownEnd
	// void CountDownEnd();                                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Vehicles/ActorRefCountDown.ActorRefCountDown_C.ExecuteUbergraph_ActorRefCountDown
	// void ExecuteUbergraph_ActorRefCountDown(int32_t EntryPoint);                                                             // [0x1325ea0] Final|HasDefaults    
	// Function /Game/Blueprints/Vehicles/ActorRefCountDown.ActorRefCountDown_C.CountDownEnded__DelegateSignature
	// void CountDownEnded__DelegateSignature(class AActor* ActorRef);                                                          // [0x1325ea0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/PawnDataComponent.PawnDataComponent_C
/// Size: 0x021D (541 bytes) (0x0001F8 - 0x00021D) align 16 MaxSize: 0x021D
class UPawnDataComponent_C : public USceneComponent
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x01F8   (0x0008)  MISSED
	TEnumAsByte<E_Teams>                               Team;                                                       // 0x0200   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0201   (0x0007)  MISSED
	SDK_UNDEFINED(16,618) /* FMulticastInlineDelegate */ __um(TeamChanged);                                        // 0x0208   (0x0010)  
	int32_t                                            PlayerIndex;                                                // 0x0218   (0x0004)  
	bool                                               TeamSet;                                                    // 0x021C   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/PawnDataComponent.PawnDataComponent_C.OnRep_Team
	// void OnRep_Team();                                                                                                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PawnDataComponent.PawnDataComponent_C.TeamChanged__DelegateSignature
	// void TeamChanged__DelegateSignature();                                                                                   // [0x1325ea0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Struct /Game/Blueprints/Structs/ST_PlayerStats.ST_PlayerStats
/// Size: 0x0068 (104 bytes) (0x000000 - 0x000068) align 8 MaxSize: 0x0068
struct FST_PlayerStats
{ 
	FString                                            Username_11_71DD23E54AAF2301D1C8FBB7BF020142;               // 0x0000   (0x0010)  
	int32_t                                            PlayerRank_53_283B917A4ED56611E62414AA11299031;             // 0x0010   (0x0004)  
	int32_t                                            PlayerIndex_12_BA857691428E16262C9A09B6000C837E;            // 0x0014   (0x0004)  
	int32_t                                            TotalKills_28_8B2411AA43440BC058BE0DBE58B713D8;             // 0x0018   (0x0004)  
	int32_t                                            TotalDeaths_29_EB6FF23B4F7137D118746FAF3ED141B4;            // 0x001C   (0x0004)  
	int32_t                                            TotalScore_27_8748313F49BF897E78050D9CBCA554E4;             // 0x0020   (0x0004)  
	TEnumAsByte<E_Teams>                               Team_15_8CB70CB042C78A0D44A55BAEBC456D54;                   // 0x0024   (0x0001)  
	bool                                               IsPlayer_17_6D479119438082EF932EF2AB8070AC8C;               // 0x0025   (0x0001)  
	bool                                               DisconnectedAlsoUsedForInactiveBots_65_BFEA053F4FE754F00122D684459967F2; // 0x0026   (0x0001)  
	bool                                               IsSelf_23_939B634F4024BC00902561B12C59FA01;                 // 0x0027   (0x0001)  
	TEnumAsByte<E_Units>                               PlayerClass_26_D48DC6774EDC301872826DA8F9260DF1;            // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0029   (0x0003)  MISSED
	int32_t                                            AlliedSoldierScore_32_4B2C132847CA069C25F99EBCB828D0C4;     // 0x002C   (0x0004)  
	int32_t                                            AlliedGunnerScore_34_F945500E4DE0B2616B1A36958A85FC27;      // 0x0030   (0x0004)  
	int32_t                                            AlliedCommandoScore_36_79188F514FC3A7442C6F3B8B6737DC8B;    // 0x0034   (0x0004)  
	int32_t                                            AxisSoldierScore_40_B528264F4E91B6282F0DA6AE63082CD7;       // 0x0038   (0x0004)  
	int32_t                                            AxisGunnerScore_41_79E3CA144F7C76842691108AE4413178;        // 0x003C   (0x0004)  
	int32_t                                            AxisCommandoScore_42_CEFB18AB478256CDC90D79AFE9E4C32E;      // 0x0040   (0x0004)  
	int32_t                                            AlliedTankScore_49_00F184FF44E957F44EFA228D8A2D83BA;        // 0x0044   (0x0004)  
	int32_t                                            AxisTankScore_50_D25C1B95411BB7860A42E5A7928A9C2A;          // 0x0048   (0x0004)  
	int32_t                                            AlliedPlaneScore_45_D558A6EC4ADEF583903E9B96683C9F6A;       // 0x004C   (0x0004)  
	int32_t                                            AxisPlaneScore_46_6E9BB49B4CB8338461015E81CB75898A;         // 0x0050   (0x0004)  
	int32_t                                            ManuallyCollectedEventTokens_57_3184A1F942211AF4D8896F90D8B37939; // 0x0054   (0x0004)  
	int32_t                                            AssistKills_60_44D5822D429A6DBB6EF39BAD5B3B0130;            // 0x0058   (0x0004)  
	bool                                               IsAlive_63_D853133641B5D7D6C4E72AA0F3768E4B;                // 0x005C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x005D   (0x0003)  MISSED
	int32_t                                            HealingScore_70_5FA70D6840CEC7F1D65C2D8820A9653D;           // 0x0060   (0x0004)  
	int32_t                                            PVPScore_73_FC40F1374803604DD1F1259AFB103C92;               // 0x0064   (0x0004)  
};

/// Struct /Game/Blueprints/Structs/ST_MapVote.ST_MapVote
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FST_MapVote
{ 
	FString                                            MapName_3_A1C8573249839866F394689B36B5D9D1;                 // 0x0000   (0x0010)  
	TArray<FString>                                    Voters_9_53A78AD347AC166A922CD4BBC68F9F1B;                  // 0x0010   (0x0010)  
};

/// Class /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C
/// Size: 0x04A9 (1193 bytes) (0x000270 - 0x0004A9) align 8 MaxSize: 0x04A9
class ABP_GameStateBase_C : public AGameStateBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0270   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0278   (0x0008)  
	int32_t                                            AlliedControlledObjectives;                                 // 0x0280   (0x0004)  
	int32_t                                            AxisControlledObjectives;                                   // 0x0284   (0x0004)  
	TEnumAsByte<E_Teams>                               VictoriousTeam;                                             // 0x0288   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0289   (0x0003)  MISSED
	float                                              NewGameStartTimer;                                          // 0x028C   (0x0004)  
	bool                                               GameHasEnded;                                               // 0x0290   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0291   (0x0003)  MISSED
	float                                              XPMultiplier;                                               // 0x0294   (0x0004)  
	float                                              EndOfGameNewGameStartTime;                                  // 0x0298   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x029C   (0x0004)  MISSED
	TArray<FST_PlayerStats>                            PlayerStats;                                                // 0x02A0   (0x0010)  
	TEnumAsByte<E_Scenarios>                           ActiveScenario;                                             // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x02B1   (0x0007)  MISSED
	class UW_KillFeed_C*                               KillFeed;                                                   // 0x02B8   (0x0008)  
	bool                                               TODScenarioSet;                                             // 0x02C0   (0x0001)  
	unsigned char                                      UnknownData04_6[0x7];                                       // 0x02C1   (0x0007)  MISSED
	SDK_UNDEFINED(16,619) /* FMulticastInlineDelegate */ __um(ScenarioSet);                                        // 0x02C8   (0x0010)  
	TEnumAsByte<E_AITeamPlayStyles>                    AI_AxisPlayStyle;                                           // 0x02D8   (0x0001)  
	TEnumAsByte<E_AITeamPlayStyles>                    AI_AlliedPlayStyle;                                         // 0x02D9   (0x0001)  
	unsigned char                                      UnknownData05_6[0x2];                                       // 0x02DA   (0x0002)  MISSED
	float                                              Delta_Seconds;                                              // 0x02DC   (0x0004)  
	bool                                               FullAxisSupremacy;                                          // 0x02E0   (0x0001)  
	bool                                               FullAlliedSupremacy;                                        // 0x02E1   (0x0001)  
	unsigned char                                      UnknownData06_6[0x6];                                       // 0x02E2   (0x0006)  MISSED
	class ABP_DecalManager_C*                          DecalManager;                                               // 0x02E8   (0x0008)  
	float                                              AI_DefensivePositionRadius;                                 // 0x02F0   (0x0004)  
	unsigned char                                      UnknownData07_6[0x4];                                       // 0x02F4   (0x0004)  MISSED
	TArray<FName>                                      ShuffledAlliedNames;                                        // 0x02F8   (0x0010)  
	TArray<FName>                                      ShuffledAxisNames;                                          // 0x0308   (0x0010)  
	int32_t                                            AlliedBotSpawnCounter;                                      // 0x0318   (0x0004)  
	int32_t                                            AxisBotSpawnCounter;                                        // 0x031C   (0x0004)  
	TArray<FST_MapVote>                                MapVotes;                                                   // 0x0320   (0x0010)  
	SDK_UNDEFINED(16,620) /* FMulticastInlineDelegate */ __um(MapVotesChanged);                                    // 0x0330   (0x0010)  
	bool                                               EnableBots;                                                 // 0x0340   (0x0001)  
	bool                                               EnableMaxDecalRenderDistance;                               // 0x0341   (0x0001)  
	unsigned char                                      UnknownData08_6[0x6];                                       // 0x0342   (0x0006)  MISSED
	FString                                            ServerName;                                                 // 0x0348   (0x0010)  
	bool                                               EnableBOTBalance;                                           // 0x0358   (0x0001)  
	bool                                               DefendRandomObjectiveOnSupremacy;                           // 0x0359   (0x0001)  
	bool                                               PushTowardsObjectiveDuringCombat;                           // 0x035A   (0x0001)  
	unsigned char                                      UnknownData09_6[0x5];                                       // 0x035B   (0x0005)  MISSED
	class ABP_MapCenter_C*                             MapCenter;                                                  // 0x0360   (0x0008)  
	FString                                            ServerHostName;                                             // 0x0368   (0x0010)  
	TArray<class ABP_SpawnableBase_C*>                 Spawnables_Objectives_;                                     // 0x0378   (0x0010)  
	TArray<class ABP_PlayerState_C*>                   Spectators;                                                 // 0x0388   (0x0010)  
	TArray<class ABP_Character_C*>                     AliveAlliedCharacters;                                      // 0x0398   (0x0010)  
	TArray<class ABP_Character_C*>                     AliveAxisCharacters;                                        // 0x03A8   (0x0010)  
	TArray<class ABP_PlaneBase_C*>                     ActivePlanes;                                               // 0x03B8   (0x0010)  
	bool                                               EnableRespawn;                                              // 0x03C8   (0x0001)  
	unsigned char                                      UnknownData10_6[0x3];                                       // 0x03C9   (0x0003)  MISSED
	int32_t                                            MaxPlayersPerTeam;                                          // 0x03CC   (0x0004)  
	class ABP_PlayerState_C*                           PlayerToVoteKick;                                           // 0x03D0   (0x0008)  
	int32_t                                            VotekickYesCount;                                           // 0x03D8   (0x0004)  
	int32_t                                            VotekickNoCount;                                            // 0x03DC   (0x0004)  
	int32_t                                            VoteKickTimer;                                              // 0x03E0   (0x0004)  
	unsigned char                                      UnknownData11_6[0x4];                                       // 0x03E4   (0x0004)  MISSED
	TArray<class APlayerState*>                        YesVotedPlayers;                                            // 0x03E8   (0x0010)  
	TArray<class APlayerState*>                        NoVotedPlayers;                                             // 0x03F8   (0x0010)  
	SDK_UNDEFINED(16,621) /* FMulticastInlineDelegate */ __um(NewVoteKickStarted);                                 // 0x0408   (0x0010)  
	bool                                               TeamBalanceEnabled;                                         // 0x0418   (0x0001)  
	unsigned char                                      UnknownData12_6[0x7];                                       // 0x0419   (0x0007)  MISSED
	TArray<FText>                                      GameRulesAndWelcomeMessages;                                // 0x0420   (0x0010)  
	TArray<FLinearColor>                               GameRulesAndMessagesColors;                                 // 0x0430   (0x0010)  
	int32_t                                            MaxRecons;                                                  // 0x0440   (0x0004)  
	int32_t                                            MaxHeavies;                                                 // 0x0444   (0x0004)  
	int32_t                                            MaxTroopers;                                                // 0x0448   (0x0004)  
	unsigned char                                      UnknownData13_6[0x4];                                       // 0x044C   (0x0004)  MISSED
	FText                                              RulesAndWelcomeMessages;                                    // 0x0450   (0x0018)  
	int32_t                                            VotedMapIndex;                                              // 0x0468   (0x0004)  
	unsigned char                                      UnknownData14_6[0x4];                                       // 0x046C   (0x0004)  MISSED
	TArray<class ABP_BaseController_C*>                Supporters;                                                 // 0x0470   (0x0010)  
	int32_t                                            SupporterAmount;                                            // 0x0480   (0x0004)  
	unsigned char                                      UnknownData15_6[0x4];                                       // 0x0484   (0x0004)  MISSED
	class UAudioComponent*                             CaptureAnnouncerSound;                                      // 0x0488   (0x0008)  
	class UAudioComponent*                             CaptureMusicSound;                                          // 0x0490   (0x0008)  
	FString                                            RandomLightingScenario;                                     // 0x0498   (0x0010)  
	bool                                               ServerUsesPassword;                                         // 0x04A8   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetAmountOfReconsForTeam
	// void GetAmountOfReconsForTeam(TEnumAsByte<E_Teams> Team, int32_t& ReconAmount);                                          // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.OnRep_RandomLightingScenario
	// void OnRep_RandomLightingScenario();                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.ProcessScoreAddition
	// void ProcessScoreAddition(int32_t ScoreAmount, int32_t Index, TEnumAsByte<E_Units> _IfVehicle_WhatType, bool AddToTotalScore, bool PVPScore); // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.UnregisterSupporter
	// void UnregisterSupporter(class ABP_BaseController_C*& Controller);                                                       // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.RegisterSupporter
	// void RegisterSupporter(class ABP_BaseController_C*& ControllerRef);                                                      // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.CleanUpSpectatorReferenceArray
	// void CleanUpSpectatorReferenceArray();                                                                                   // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.OnRep_PlayerToVoteKick
	// void OnRep_PlayerToVoteKick();                                                                                           // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.PermaBanPlayer
	// void PermaBanPlayer(class APlayerState* PlayerState, FString DisconnectErrorCode);                                       // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.TempBanPlayer
	// void TempBanPlayer(class APlayerState* PlayerState, FString DisconnectErrorCode);                                        // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.AddPlayerHealScore
	// void AddPlayerHealScore(int32_t PlayerIndex, int32_t HealScoreToAdd);                                                    // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.SetPlayerAliveStatus
	// void SetPlayerAliveStatus(int32_t PlayerIndex, bool IsAlive);                                                            // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.RegisterNewPlane
	// void RegisterNewPlane(class ABP_PlaneBase_C* Plane);                                                                     // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.RemoveSpectator
	// void RemoveSpectator(class ABP_PlayerState_C*& PlayerState);                                                             // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.AddSpectator
	// void AddSpectator(class ABP_PlayerState_C*& PlayerState);                                                                // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.SpawnLandingCraft
	// void SpawnLandingCraft(FTransform SpawnTransform, bool AI_Controlled, TEnumAsByte<E_Teams> Team, class ABP_LandingCraft_C*& LandingCraft); // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetNextScenario
	// void GetNextScenario(TEnumAsByte<E_Scenarios> CurrentScenario, TEnumAsByte<E_Scenarios>& NextScenario);                  // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.IncreaseEventToken
	// void IncreaseEventToken(int32_t PlayerIndex);                                                                            // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetPlayerWithHighestHealScore
	// void GetPlayerWithHighestHealScore(int32_t& PlayerIndex, bool& NoScore);                                                 // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.PermaRemoveAIControlledVehicles
	// void PermaRemoveAIControlledVehicles();                                                                                  // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.OnRep_MapVotes
	// void OnRep_MapVotes();                                                                                                   // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetVotesForMap
	// void GetVotesForMap(FString Map, int32_t& MapVotes);                                                                     // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.AddMapVote
	// void AddMapVote(FString Map, FString VoterName);                                                                         // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetVotedForMap
	// void GetVotedForMap(FString& Map);                                                                                       // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetPlayerWithMostPlaneScore
	// void GetPlayerWithMostPlaneScore(int32_t& PlayerIndex, bool& NoScore);                                                   // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetPlayerWithMostTankScore
	// void GetPlayerWithMostTankScore(int32_t& PlayerIndex, bool& NoScore);                                                    // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetPlayerWithMostKills
	// void GetPlayerWithMostKills(int32_t& PlayerIndex);                                                                       // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetPlayerWithHighestScore
	// void GetPlayerWithHighestScore(int32_t& PlayerIndex);                                                                    // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.UpdatePlayerClass
	// void UpdatePlayerClass(int32_t PlayerIndex, TEnumAsByte<E_Units> PlayerClass);                                           // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.DoesTeamHaveAllObjectives?
	// void DoesTeamHaveAllObjectives_(TEnumAsByte<E_Teams> Team, bool& HasAllObjectives);                                      // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.SetScenario
	// void SetScenario();                                                                                                      // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetRandomAvailableFlag
	// void GetRandomAvailableFlag(TEnumAsByte<E_Teams> Team, class ABP_Flag_C*& Flag);                                         // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.RemoveLowestScoreBotFromTeam
	// void RemoveLowestScoreBotFromTeam(TEnumAsByte<E_Teams> Team);                                                            // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetTeamBalance
	// void GetTeamBalance(int32_t& AlliedCharacters, int32_t& AxisCharacters);                                                 // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.OnRep_ActiveScenario
	// void OnRep_ActiveScenario();                                                                                             // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.UpdatePlayerTeam
	// void UpdatePlayerTeam(int32_t PlayerIndex, TEnumAsByte<E_Teams> Team);                                                   // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.AddPlayerScore
	// void AddPlayerScore(int32_t ScoreAmount, int32_t PlayerIndex, TEnumAsByte<E_Units> IfVehicle_WhatType_, bool IsPVPScore); // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.AddPlayerDeath
	// void AddPlayerDeath(int32_t PlayerIndex);                                                                                // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.AddPlayerKill
	// void AddPlayerKill(int32_t KillerPlayerIndex, int32_t VictimPlayerIndex, bool AIVehicle, FString AIVehicleName, TEnumAsByte<E_Teams> AIVehicleTeam, bool IsAssistKill); // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.RemoveAliveCharacter
	// void RemoveAliveCharacter(class ABP_Character_C*& Character, TEnumAsByte<E_Teams> Team);                                 // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.AddAliveCharacter
	// void AddAliveCharacter(class ABP_Character_C*& Character, TEnumAsByte<E_Teams> Team);                                    // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.OnRep_VictoriousTeam
	// void OnRep_VictoriousTeam();                                                                                             // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.EndGame
	// void EndGame(TEnumAsByte<E_Teams> VictoriousTeam);                                                                       // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.GetControlledObjectivesFromTeam
	// void GetControlledObjectivesFromTeam(TEnumAsByte<E_Teams> Team, int32_t& ObjectiveCount);                                // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.RegisterSpawnable(Objective)
	// void RegisterSpawnable_Objective_(class ABP_SpawnableBase_C*& Objective);                                                // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.UnregisterCharacter
	// void UnregisterCharacter(int32_t PlayerIndex);                                                                           // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.RegisterCharacter
	// void RegisterCharacter(class ABP_Character_C* Character, TEnumAsByte<E_Teams> Team);                                     // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.SpawnAICharacter
	// void SpawnAICharacter(int32_t Amount, TEnumAsByte<E_Teams> Team, bool IsNewCharacter, class ABP_Character_C* OldCharacterRef); // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x1325ea0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.RespawnActor
	// void RespawnActor(FTransform SpawnTransform, class UClass* Class, bool AIControlled, TEnumAsByte<E_Teams> Team, TEnumAsByte<E_VehicleSkinThemes> VehicleSkinTheme, class ABP_VehicleSwapBoard_Base_C* VehicleSwapBoardRef, bool UseAIWhenNotControlledByPlayer); // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.OnKill
	// void OnKill(TEnumAsByte<E_Teams> Team);                                                                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.OnGameHasEnded
	// void OnGameHasEnded();                                                                                                   // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.MC_ShareChatMessage
	// void MC_ShareChatMessage(FText UserName, FText Message, bool SpecialMessage, TEnumAsByte<E_Teams> Team);                 // [0x1325ea0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.MC_KillFeedAdd
	// void MC_KillFeedAdd(FST_PlayerStats KillerStats, FST_PlayerStats VictimStats);                                           // [0x1325ea0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.UpdateSky
	// void UpdateSky();                                                                                                        // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.StartVoteKick
	// void StartVoteKick(class ABP_PlayerState_C* PlayerToVoteKick, int32_t VoteKickTimer);                                    // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.CastVote
	// void CastVote(bool Yes, class APlayerState*& PlayerState);                                                               // [0x1325ea0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.AnnounceSoundEnd
	// void AnnounceSoundEnd();                                                                                                 // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.AnnounceObjectiveCapture
	// void AnnounceObjectiveCapture(TEnumAsByte<E_Teams> Team);                                                                // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.LoadLightingScenarioLevel
	// void LoadLightingScenarioLevel();                                                                                        // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.ExecuteUbergraph_BP_GameStateBase
	// void ExecuteUbergraph_BP_GameStateBase(int32_t EntryPoint);                                                              // [0x1325ea0] Final|HasDefaults    
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.NewVoteKickStarted__DelegateSignature
	// void NewVoteKickStarted__DelegateSignature();                                                                            // [0x1325ea0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.MapVotesChanged__DelegateSignature
	// void MapVotesChanged__DelegateSignature();                                                                               // [0x1325ea0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameStateBase.BP_GameStateBase_C.ScenarioSet__DelegateSignature
	// void ScenarioSet__DelegateSignature();                                                                                   // [0x1325ea0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/Gamestates/BP_GameState_Elimination.BP_GameState_Elimination_C
/// Size: 0x04BC (1212 bytes) (0x0004A9 - 0x0004BC) align 8 MaxSize: 0x04BC
class ABP_GameState_Elimination_C : public ABP_GameStateBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x04A9   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04B0   (0x0008)  
	int32_t                                            RoundTimer_InSeconds_;                                      // 0x04B8   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Gamestates/BP_GameState_Elimination.BP_GameState_Elimination_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameState_Elimination.BP_GameState_Elimination_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameState_Elimination.BP_GameState_Elimination_C.StartNewRound
	// void StartNewRound();                                                                                                    // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameState_Elimination.BP_GameState_Elimination_C.ExecuteUbergraph_BP_GameState_Elimination
	// void ExecuteUbergraph_BP_GameState_Elimination(int32_t EntryPoint);                                                      // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Gamestates/BP_Gamestate_DualRocket.BP_Gamestate_DualRocket_C
/// Size: 0x04E8 (1256 bytes) (0x0004A9 - 0x0004E8) align 8 MaxSize: 0x04E8
class ABP_Gamestate_DualRocket_C : public ABP_GameStateBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x04A9   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04B0   (0x0008)  
	class ABP_Rocket_C*                                RocketRef;                                                  // 0x04B8   (0x0008)  
	int32_t                                            AxisTimer;                                                  // 0x04C0   (0x0004)  
	int32_t                                            AlliedTimer;                                                // 0x04C4   (0x0004)  
	int32_t                                            MaxTeamTimerAmount;                                         // 0x04C8   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x04CC   (0x0004)  MISSED
	TArray<class ABP_Rocket_C*>                        Rockets;                                                    // 0x04D0   (0x0010)  
	int32_t                                            AlliedTimeDepletionAmount;                                  // 0x04E0   (0x0004)  
	int32_t                                            AxisTimeDepletionAmount;                                    // 0x04E4   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Gamestates/BP_Gamestate_DualRocket.BP_Gamestate_DualRocket_C.ReduceTickets
	// void ReduceTickets(TEnumAsByte<E_Teams> Team, int32_t Amount);                                                           // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_Gamestate_DualRocket.BP_Gamestate_DualRocket_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_Gamestate_DualRocket.BP_Gamestate_DualRocket_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_Gamestate_DualRocket.BP_Gamestate_DualRocket_C.ExecuteUbergraph_BP_Gamestate_DualRocket
	// void ExecuteUbergraph_BP_Gamestate_DualRocket(int32_t EntryPoint);                                                       // [0x1325ea0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Gamestates/BP_GameState_Conquest.BP_GameState_Conquest_C
/// Size: 0x04D8 (1240 bytes) (0x0004A9 - 0x0004D8) align 8 MaxSize: 0x04D8
class ABP_GameState_Conquest_C : public ABP_GameStateBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x04A9   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04B0   (0x0008)  
	int32_t                                            AlliedTickets;                                              // 0x04B8   (0x0004)  
	int32_t                                            AxisTickets;                                                // 0x04BC   (0x0004)  
	int32_t                                            MaxTeamTicketAmount;                                        // 0x04C0   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x04C4   (0x0004)  MISSED
	class UAudioComponent*                             CaptureAnnouncerSound;                                      // 0x04C8   (0x0008)  
	class UAudioComponent*                             CaptureMusicSound;                                          // 0x04D0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Gamestates/BP_GameState_Conquest.BP_GameState_Conquest_C.ReduceTickets
	// void ReduceTickets(TEnumAsByte<E_Teams> Team, int32_t Amount);                                                           // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameState_Conquest.BP_GameState_Conquest_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameState_Conquest.BP_GameState_Conquest_C.OnKill
	// void OnKill(TEnumAsByte<E_Teams> Team);                                                                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_GameState_Conquest.BP_GameState_Conquest_C.ExecuteUbergraph_BP_GameState_Conquest
	// void ExecuteUbergraph_BP_GameState_Conquest(int32_t EntryPoint);                                                         // [0x1325ea0] Final                
};

/// Class /Game/Blueprints/Gamestates/BP_Gamestate_CaptureAndHold.BP_Gamestate_CaptureAndHold_C
/// Size: 0x04E1 (1249 bytes) (0x0004A9 - 0x0004E1) align 8 MaxSize: 0x04E1
class ABP_Gamestate_CaptureAndHold_C : public ABP_GameStateBase_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x04A9   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04B0   (0x0008)  
	class ABP_CaptureAndHoldObjectiveBase_C*           ObjectiveRef;                                               // 0x04B8   (0x0008)  
	int32_t                                            AxisTimer;                                                  // 0x04C0   (0x0004)  
	int32_t                                            AlliedTimer;                                                // 0x04C4   (0x0004)  
	int32_t                                            MaxTeamTimerAmount;                                         // 0x04C8   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x04CC   (0x0004)  MISSED
	class UAudioComponent*                             CaptureAnnouncerSound;                                      // 0x04D0   (0x0008)  
	class UAudioComponent*                             CaptureMusicSound;                                          // 0x04D8   (0x0008)  
	bool                                               UseAltSpawns;                                               // 0x04E0   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Gamestates/BP_Gamestate_CaptureAndHold.BP_Gamestate_CaptureAndHold_C.ReduceTickets
	// void ReduceTickets(TEnumAsByte<E_Teams> Team, int32_t Amount);                                                           // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_Gamestate_CaptureAndHold.BP_Gamestate_CaptureAndHold_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_Gamestate_CaptureAndHold.BP_Gamestate_CaptureAndHold_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Gamestates/BP_Gamestate_CaptureAndHold.BP_Gamestate_CaptureAndHold_C.ExecuteUbergraph_BP_Gamestate_CaptureAndHold
	// void ExecuteUbergraph_BP_Gamestate_CaptureAndHold(int32_t EntryPoint);                                                   // [0x1325ea0] Final|HasDefaults    
};

/// Struct /Game/Blueprints/Gamemodes/ST_UserIDBanCheck.ST_UserIDBanCheck
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FST_UserIDBanCheck
{ 
	FString                                            UserID_4_0FFE6D2D4F7D29F9607CEB8559ACE1A5;                  // 0x0000   (0x0010)  
	class AController*                                 ControllerRef_6_F897C4AA4B87B714A5206FA9E3B6231B;           // 0x0010   (0x0008)  
};

/// Class /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C
/// Size: 0x0334 (820 bytes) (0x0002C0 - 0x000334) align 8 MaxSize: 0x0334
class ABP_GameModeBase_C : public AGameModeBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02C8   (0x0008)  
	TArray<FSessionPropertyKeyPair>                    LastFetchedExtraSessionSettings;                            // 0x02D0   (0x0010)  
	int32_t                                            ConnectedPlayerAmount;                                      // 0x02E0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02E4   (0x0004)  MISSED
	TArray<FST_UserIDBanCheck>                         ToBeBanCheckedIDs;                                          // 0x02E8   (0x0010)  
	TArray<FString>                                    LatestCommunityBanList;                                     // 0x02F8   (0x0010)  
	TArray<FString>                                    LatestCommunityStatBanList;                                 // 0x0308   (0x0010)  
	bool                                               BanListReady;                                               // 0x0318   (0x0001)  
	bool                                               StatBanListReady;                                           // 0x0319   (0x0001)  
	bool                                               UsesPassword;                                               // 0x031A   (0x0001)  
	unsigned char                                      UnknownData01_6[0x5];                                       // 0x031B   (0x0005)  MISSED
	TArray<class AController*>                         ConnectedControllers;                                       // 0x0320   (0x0010)  
	int32_t                                            MaxPlayers;                                                 // 0x0330   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.CheckUserSteamLevel
	// void CheckUserSteamLevel();                                                                                              // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.CheckIfPlayerIsBannedOnHost
	// void CheckIfPlayerIsBannedOnHost(FString UniqueUserID, class AController* Player);                                       // [0x1325ea0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.OnCallback_51E0242441E539B2A26CA696B1B5033B
	// void OnCallback_51E0242441E539B2A26CA696B1B5033B();                                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.OnCallback_04A00BC149EE18F59439E3BFA5612CA0
	// void OnCallback_04A00BC149EE18F59439E3BFA5612CA0();                                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.K2_OnLogout
	// void K2_OnLogout(class AController* ExitingController);                                                                  // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.K2_PostLogin
	// void K2_PostLogin(class APlayerController* NewPlayer);                                                                   // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.UpdateSessionInt
	// void UpdateSessionInt(FString PropertyKey, int32_t Value);                                                               // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.UpdateSessionString
	// void UpdateSessionString(FString PropertyKey, FString StringValue);                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.CheckIfPlayerIsCommunityBanned
	// void CheckIfPlayerIsCommunityBanned();                                                                                   // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.BanEnforcePlayer
	// void BanEnforcePlayer(class AController* Player);                                                                        // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.FetchLatestBanLists
	// void FetchLatestBanLists();                                                                                              // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.BanListFetched
	// void BanListFetched(class UVaRestRequestJSON* Request);                                                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.StatBanListFetched
	// void StatBanListFetched(class UVaRestRequestJSON* Request);                                                              // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.BootPlayer
	// void BootPlayer(class AController* Player, FString DisconnectErrorCode, bool FastBoot);                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Gamemodes/BP_GameModeBase.BP_GameModeBase_C.ExecuteUbergraph_BP_GameModeBase
	// void ExecuteUbergraph_BP_GameModeBase(int32_t EntryPoint);                                                               // [0x1325ea0] Final|HasDefaults    
};

/// Struct /Game/Blueprints/Structs/ST_UnitProgress.ST_UnitProgress
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 8 MaxSize: 0x0014
struct FST_UnitProgress
{ 
	FString                                            UnitAPIName_6_48EAEE4E4461D6D6AAA02F98C3073822;             // 0x0000   (0x0010)  
	int32_t                                            Xp_11_D588E55147AF9D52BAB24FBE524C62BA;                     // 0x0010   (0x0004)  
};

/// Struct /Game/Blueprints/Structs/ST_EventProgress.ST_EventProgress
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FST_EventProgress
{ 
	int32_t                                            Pumpkins_2_904192FD49275DECAE90A5B56DB4B5EF;                // 0x0000   (0x0004)  
};

/// Struct /Game/Blueprints/CosmeticItems/ST_TokenAmount.ST_TokenAmount
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 8 MaxSize: 0x0014
struct FST_TokenAmount
{ 
	FDataTableRowHandle                                TokenEvent_7_0EDE68B147468AF2A2C375896D00F5F0;              // 0x0000   (0x0010)  
	int32_t                                            TokenAmount_5_1ED1664847A4E74FCB69008C789267FA;             // 0x0010   (0x0004)  
};

/// Class /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C
/// Size: 0x063C (1596 bytes) (0x000570 - 0x00063C) align 8 MaxSize: 0x063C
class ABP_BaseController_C : public AClientAuthoritativePlayerController
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0570   (0x0008)  
	bool                                               bStatsReady;                                                // 0x0578   (0x0001)  
	bool                                               bSteamInventoryReady;                                       // 0x0579   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x057A   (0x0006)  MISSED
	TArray<FST_UnitProgress>                           UnitProgress;                                               // 0x0580   (0x0010)  
	SDK_UNDEFINED(16,622) /* FMulticastInlineDelegate */ __um(StatsRefreshed);                                     // 0x0590   (0x0010)  
	FST_EventProgress                                  EventProgess;                                               // 0x05A0   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x05A4   (0x0004)  MISSED
	SDK_UNDEFINED(16,623) /* FMulticastInlineDelegate */ __um(SteamInventoryRefreshed);                            // 0x05A8   (0x0010)  
	int32_t                                            Token_Pumpkins;                                             // 0x05B8   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x05BC   (0x0004)  MISSED
	SDK_UNDEFINED(16,624) /* FMulticastInlineDelegate */ __um(ChestCrafted);                                       // 0x05C0   (0x0010)  
	class UW_SteamProcessingPopup_C*                   SteamProcessPopupRef;                                       // 0x05D0   (0x0008)  
	SDK_UNDEFINED(16,625) /* FMulticastInlineDelegate */ __um(ChestOpened);                                        // 0x05D8   (0x0010)  
	class APostProcessVolume*                          PostProcessVolume;                                          // 0x05E8   (0x0008)  
	bool                                               DLC_Supporter;                                              // 0x05F0   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x05F1   (0x0007)  MISSED
	TArray<FSteamItemDetails>                          SteamInventoryPro;                                          // 0x05F8   (0x0010)  
	FSteamInventoryResult                              LastInventoryHandlePro;                                     // 0x0608   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x060C   (0x0004)  MISSED
	TArray<FSteamItemDetails>                          LatestItems;                                                // 0x0610   (0x0010)  
	TArray<FST_TokenAmount>                            EventTokens;                                                // 0x0620   (0x0010)  
	FTimerHandle                                       SteamRefreshTimerHandler;                                   // 0x0630   (0x0008)  
	int32_t                                            CoinAmount;                                                 // 0x0638   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.GetDropType
	// void GetDropType(FSteamItemDef& SteamItemDef);                                                                           // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.GetChestAmount
	// void GetChestAmount(int32_t& ChestAmount);                                                                               // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.ConsolidateItemsOfID
	// void ConsolidateItemsOfID(int32_t ID);                                                                                   // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.CheckLocalSupporterDLCState
	// void CheckLocalSupporterDLCState(bool& isSupporter);                                                                     // [0x1325ea0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.InitOptions
	// void InitOptions();                                                                                                      // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.ShowSteamProcessPopup
	// void ShowSteamProcessPopup(FText Message);                                                                               // [0x1325ea0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.UpdateInventoryWithLatestResult
	// void UpdateInventoryWithLatestResult(TArray<FSteamItemDetails>& ResultArray);                                            // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.GetItemInstanceID
	// void GetItemInstanceID(int32_t ID, FSteamItemInstanceID& InstanceID);                                                    // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.Get Stacked Item ID Amount
	// void GetStackedItemIDAmount(int32_t ItemId, int32_t& Amount);                                                            // [0x1325ea0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.InpActEvt_I_K2Node_InputKeyEvent
	// void InpActEvt_I_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x1325ea0] BlueprintEvent       
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1325ea0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.GetStats
	// void GetStats();                                                                                                         // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.RequestStats
	// void RequestStats();                                                                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.TriggerItemDrop
	// void TriggerItemDrop();                                                                                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.CraftChest
	// void CraftChest(int32_t Bundle, int32_t MaterialID, int32_t MaterialQuantity, TEnumAsByte<E_ChestTypes> ChestType);      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.OpenChest
	// void OpenChest(int32_t Generator, int32_t ChestID);                                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.RefreshCachedSteamInventory
	// void RefreshCachedSteamInventory();                                                                                      // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.RefreshInventoryFromResult
	// void RefreshInventoryFromResult(FSteamInventoryResult ResultHandle);                                                     // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.S_ParseSupporterDLCState
	// void S_ParseSupporterDLCState();                                                                                         // [0x1325ea0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.ReceiveDestroyed
	// void ReceiveDestroyed();                                                                                                 // [0x1325ea0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.ForceStackItems
	// void ForceStackItems();                                                                                                  // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.StatsReady
	// void StatsReady();                                                                                                       // [0x1325ea0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Controllers/BP_BaseController.BP_BaseController_C.ReimburseOldChests
	// void ReimburseOldChests(int32_t OldChestReimburseBundle, int32_t OldChestID);                                            // [0x1325ea0] BlueprintCallable|BlueprintEvent 
